[
    {
        "title": "A unit of Kanjeevaram looms in Hyderabad, established by textile designer Gaurang Shah, looks to revive heritage designs",
        "author": [
            "Authors"
        ],
        "publish_date": "2024-08-29",
        "text": "The steady, rhythmic rattle of the looms is audible as we enter a house in Injapuram, on the outskirts of Hyderabad. Brothers Yadagiri and Nagaraj, who were earlier part of the Gadwal silk weaving community at Amangal, Ranga Reddy district, in Telangana, now oversee the 12-loom Kanjeevaram unit in Injapuram, established by Hyderabad-based textile designer Gaurang Shah.\n\nThere is a steady output of premium handwoven Kanjeevaram saris from these looms, with some of them reviving heritage designs and colours. Gaurang had initially collaborated with weavers in Kanchipuram, Tamil Nadu, but it required frequent travelling to oversee the weaving process. “There was also the risk of designs being plagiarised or our supply of pure silver and gold zari threads being replaced with non-genuine material,” he explains. When the erstwhile Gadwal weavers from Amangal expressed interest in working on Kanjeevaram saris, it turned out to be a win-win situation for the weavers and the designer.\n\n“The weaving process is not very different for Gadwal and Kanchi silk saris,” says Gaurang. While a few weavers who knew the basics of Gadwal weaving joined the team, others with no prior weaving experience were trained.\n\nInspired by temple sculptures\n\nOn these looms, Gaurang is on a mission to revive some of the traditional designs inspired by sculptures in the temples of Tamil Nadu. For instance, he shows a design sheet that features a procession of elephants and has motifs of chakras, temple pillars and animal figures. “Some of the old sculptures we came across had designs that fuse the body of one animal with the head of another. We have tried to bring back such designs,” he explains.\n\nDesigns are hand drawn, then computerised to be transferred or punched on cards. The punched cards, with holes, are used in the jacquard on the looms. This mechanised transfer of designs on the jacquard looms allows complex patterns to be woven with ease.\n\nThe warping process, which used to be done by hand in the early years, is now mechanised. The weft yarn is then transferred to the bobbins with the help of charkhas. A spindle fill the weft yarns into bobbins for the shuttles. In these looms, simple weights such as water bottles filled with sand help maintain the tension of the warp.\n\nGaurang explains how the Kanchi saris are known for their contrasting borders that differ from the body of the sari. He shows a sari and explains, “The warp is pure gold zari while the weft is blue.” At the other end of the loom, yarn in the traditional ‘arakku’ colour (a deep pink-red hue)is awaiting the loom process.\n\nYarn to sari, under one roof\n\nOn the terrace of the spacious house, dyers mix dyes to match the shade selected from a shade card. They dip the yarn in boiling water and then mix in the colour before it is dipped again. Yadagiri explains, “Since the silk yarn is procured locally and everything from the warping to the dyeing and weaving process is done in-house, we have a control over the quality.”\n\nOn average, the weavers manage to complete three silk saris a month. Yadagiri says production slows down during peak monsoon since damp weather is not conducive to the Kanchi weaving process. The price of saris woven here ranges from ₹50,000 to ₹5 lakh or more, depending on the intricacies of the design and the zari. “I pay weavers ₹30,000 to weave a single shuttle sari which takes nearly 12 days, and ₹45,000 to ₹50,000 for a three-shuttle sari which takes 25 days,” says Gaurang.\n\nThe Injapuram Kanchi weaving facility was established three years ago and the designer hopes to expand it to 20 looms, depending on how soon he can get more new weavers to join the group.\n\n(The writer visited these looms on invitation)",
        "top_image": "https://th-i.thgim.com/public/incoming/9hglt2/article68554061.ece/alternates/LANDSCAPE_1200/IMG20240810131556.jpg",
        "link": "https://www.thehindu.com/life-and-style/fashion/a-unit-of-kanjeevaram-looms-in-hyderabad-established-by-gaurang-shah-looks-to-revive-heritage-designs/article68550236.ece"
    },
    {
        "title": "KK, daughter GHMC mayor Vijayalakshmi to leave BRS on March 30, KCR upset, son denies hand",
        "author": [
            "Jbs Umanadh"
        ],
        "publish_date": "2024-03-28",
        "text": "HYDERABAD: Senior BRS leader and Rajya Sabha MP Kancharla Keshava Rao (KK) may return to the Congress fold with his daughter and Hyderabad Mayor Gadwal Vijayalakshmi on March 30.\n\nIt is said that the senior BRS leader met party chief K Chandrashekar Rao and expressed his wish to return to the Congress from where he started his political career. Party sources said that the BRS supreme was upset with KK’s decision as he enjoyed every position during the decade-long rule of KCR and wanted to quit when the party needed his experience. “The party treated him with respect and gave him freedom to work,” KCR said to have observed.\n\nOn the other hand, the shift of loyalty by Gadwal Vijaya Lakshmi could be considered as the Congress party’s effort to strengthen its position in the GHMC region, the stronghold of the BRS.\n\nMeanwhile, KK’s son, Kancharla Viplav Kumar, who was ex-chairman for TS Urban Finance Infrastructure Development Corporation Ltd denied his hand in the shifting of loyalty by his father and sister to the Congress. He made it clear that he would stick with the BRS.\n\n“I hereby clarify that I have nothing to do with news in media regarding the decisions of K.K. or Vijayalaxmi on thinking about changing the party. I am very clear that I am not changing the party am a strong supporter of BRS and have a great belief in the leadership of our leader KCR. I will be able to talk more only after their confirmation of joining the congress,” he said taking to X on Thursday.\n\nJoining date of Keshav Rao yet to be finalised\n\nKeshav Rao said that he had served 53 years in the Congress and barely 10 years in the BRS. “Whoever goes on pilgrimage will finally return home. I have joined the BRS for the sake of Telangana. It’s the Congress that has granted Telangana as a separate state. First time,\n\nI was elected to the Rajya Sabha with the second preference vote of the Congress.\n\n“I was born and grown up in the Congress. I wish to die as a Congressman. I haven’t resigned from the BRS yet. I am not joining the Congress on the day when my daughter is joining. I will inform you the date after it’s finalised. My son, however, wants to stay in the BRS. Former Minister Indrakaran Reddy is also joining the Congress,” Keshav Rao said.\n\nMayor Vijayalakshmi will be joining on March 30.",
        "top_image": "https://www.newstap.in/h-upload/2024/03/28/1603863-whatsapp-image-2024-03-28-at-180331.webp",
        "link": "https://www.newstap.in/telangana/kk-daughter-ghmc-mayor-vijayalakshmi-to-leave-brs-on-march-30-kcr-upset-son-denies-hand-1527914"
    },
    {
        "title": "Video: Hyderabad Mayor draws ire over sword display at Bathukamma event",
        "author": [
            "News Desk"
        ],
        "publish_date": "2024-10-11",
        "text": "Hyderabad: Hyderabad Mayor Vijaylaxmi Gadwal raked in controversy after brandishing a sword at Bathukamma celebrations at NBT Nagar Banjara Hills on Thursday, October 10.\n\nThe Mayor uploaded the video on her social media accounts where women dressed in traditional attire are seen dancing to music played on a DJ system at high volume.\n\nIn the videos, the Hyderabad Mayor who is standing atop a dais, is seen brandishing a sword. “No one should put evil eye on women and girls in NBT Nagar. Today I am wielding a sword, tomorrow you all girls should hold the sword,” said Gadwal, drawing cheers from the crowd.\n\nAlso Read Hyderabad police ban DJs, firecrackers during religious processions\n\n“We are celebrating Bathukamma here, and some jealous people are calling the police on us,” added Gadwal. The Hyderabad Mayor made these statements after some local residents complained to the police about the DJ playing music too loudly at the venue.\n\nIt is pertinent to note that the Hyderabad police have banned the use of firecrackers and DJs for music during religious processions and events, citing noise pollution and the safety of residents.\n\nThe decision was made after observing an alarming increase in the use of DJ sound systems and firecrackers during these processions. The use of DJ systems during religious processions also increases the chances of uncontrolled behaviour by participants, potentially leading to law and order issues, the police had stated.\n\nAdditionally, the use of firecrackers in procession routes in Hyderabad crowded with hundreds or thousands of people poses a significant danger.\n\nAlso Read Hyderabad Mayor, Corporators meet Yogi during study tour in Lucknow\n\nAlthough DJs are banned during religious processions in Hyderabad, sound systems are permitted, but with restrictions on sound decibel limits.",
        "top_image": "https://cdn.siasat.com/wp-content/uploads/2024/10/Hyderabad-Mayor-sword-bathukamma.jpg",
        "link": "https://www.siasat.com/video-hyderabad-mayor-draws-ire-over-sword-display-at-bathukamma-event-3110955/"
    },
    {
        "title": "Hyderabad Mayor Vijayalakshmi Booked for Noise Pollution Violations",
        "author": [
            "Dc Correspondent",
            "About The Author"
        ],
        "publish_date": "2024-10-14",
        "text": "Hyderabad:The Banjara Hills police on Sunday booked a suo motu case against Hyderabad mayor Gadwal Vijayalakshmi for violating noise pollution norms during the Bathukamma celebrations on October 10.\n\nAccording to the police, the mayor was present at the Bathukamma celebrations at NBT Nagar where DJs played loud music beyond permitted hours. Locals complained to the police about the noise pollution during late hours.\n\n\n\nSpeaking at the event, Vijayalakshmi said that some jealous people did not like the Bathukamma celebrations and had informed the police.\n\n\n\nA video of the Mayor at the same event went viral, showing her wielding a sword and assuring the people of NBT Nagar of Banjara Hills, from where she is a corporators, need not worry and people who resort to atrocities against women would not be spared.\n\n22-Year-Old Band Master Found Dead in Jagathgirigutta\n\nHyderabad:The body of a 22-year-old band master was found in an isolated place in Teen Bandhu Colony at about 3 am on Sunday, Jagathgirigutta police said. The victim Mohammed Nadeem Pasha had left his house at 2 pm on Saturday.\n\n\n\nPolice suspect that one Khaleel along with his associates might have hit the victim. A special team is trying to arrest the accused.\n\nMan Murders Wife After Dispute Over Attire in Saroornagar\n\nHyderabad:A man murdered his wife reportedly when she asked him to wear a kurta pyjama on Sunday afternoon, Saroornagar police said. The deceased has been identified as Soni, 32, and the accused as Venkatesh, 37.\n\n\n\nSaroornagar investigating officer Mahender said Soni was a victim of domestic violence and Venkatesh would beat her up on at home.\n\n\n\n\"His wife cajoled him a bit to wear a Punjabi dress and so he was angry. This sparked a quarrel and Venkatesh stabbed her. There are eight stab injuries in different parts of Soni’s body,\" Mahender said.\n\n\n\nVenkatesh has reportedly been taken into police custody. He reportedly suffered an injury on his hand during the assault on Soni. Police said they were investigating the case.\n\n",
        "top_image": "https://www.deccanchronicle.com/h-upload/2024/10/13/1851680-vijaya-lakshmi.jpg",
        "link": "https://www.deccanchronicle.com/news/crime/hyderabad-mayor-vijayalakshmi-booked-for-noise-pollution-violations-1829975"
    },
    {
        "title": "MLA explanation about his party changing",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-06-19",
        "text": "Gadwal: Gadwal MLA Bandla Krishnamohan Reddy has publicly addressed recent rumors about his potential shift to the Congress Party. He clarified that these stories circulating on TV channels and social media were deliberately planted to cause confusion and frustration.\n\nReddy emphasized that he remains committed to the BRS party and assured that the party is not facing any internal breakup. This statement was made during a media interaction at the BRS party office in the Jogulamba Gadwal district center.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/06/19/1455723-mla.jpg",
        "link": "https://www.thehansindia.com/telangana/mla-explanation-about-his-party-changing-885894"
    },
    {
        "title": "Alampur MLA, others held for switching on Tummilla motors in absence of Congress leader",
        "author": [
            "Authors"
        ],
        "publish_date": "2024-08-06",
        "text": "Bharat Rashtra Samithi (BRS) working president K.T. Rama Rao has criticised the Jogulamba-Gadwal district administration and the police for arresting Alampur MLA Vijayudu along with a few farmers and local leaders of the party for switching on the motors of Tummilla lift irrigation project to supplement water to the Rajolibanda Diversion Scheme (RDS) ayacut.\n\nAccording to information reaching here, the MLA along with some BRS leaders went to Tummilla in Vaddepally mandal in the district, located on the left bank of Sunkesula Barrage constructed across the Tungabhadra river, following the decision taken by the authorities to switch on the motors to release water to the ayacut.\n\nThe officials asked the MLA to wait till Congress leader S.A. Sampath Kumar, a former MLA who lost the 2023 election at the hands of Mr. Vijayudu, arrived there for the event of switching on the motors. After waiting for some time, Mr. Vijayudu went ahead and switched on the motors despite officials objecting to it, resulting in a heated argument.\n\nThe authorities switched off the motors within a few minutes as they wanted Mr. Sampath Kumar to be present there. Angered by that, Mr. Vijayudu along with BRS leaders and farmers staged a protest and were later arrested.\n\nMr. Rama Rao sought to know whether Praja Palana meant humiliating the elected public representatives of the Opposition party and asked the authorities why they were insisting on the switching on of motors by a Congress leader in violation of the protocol.\n\nTummilla lift irrigation project was planned in 2017 and the first phase with three motors of 8 megawatt capacity each was completed in 2018 with an expenditure of ₹397 crore to supplement water to the 55,600 acres ayacut out of the total of 87,500 acres under RDS in Gadwal and Alampur constituencies. It was formally commissioned on November 23, 2018.",
        "top_image": "https://th-i.thgim.com/public/news/national/telangana/1tadcu/article68492650.ece/alternates/LANDSCAPE_1200/WhatsApp%20Image%202024-08-06%20at%202.10.45%20PM%201.jpeg",
        "link": "https://www.thehindu.com/news/national/telangana/alampur-mla-others-held-for-switching-on-tummilla-motors-in-absence-of-congress-leader/article68492655.ece"
    },
    {
        "title": "Gadwal MLA set to return to BRS, meets KTR",
        "author": [
            "Md Nizamuddin"
        ],
        "publish_date": "2024-07-30",
        "text": "Hyderabad: Gadwal MLA B Krishna Mohan Reddy who had recently switched over to Congress has decided to return back to the BRS party. In a significant development on Tuesday, the MLA called on BRS working president K T Rama Rao in the Assembly to express his resolve to return back to the party fold.\n\nThe MLA who will be formally returning to the BRS will also be meeting BRS chief K Chandrasekhar Rao shortly. This development comes within a month of his defection to the Congress, in presence of Chief Minister A Revanth Reddy. After the MLA’s ghar wapsi the number of defected MLAs from BRS to Congress will drop to single digit. The decision by Gadwal MLA is considered to be set back to Congress, which in a phased manner have begun poaching MLAs, particularly after Revanth affirmed that the party has ‘opened gates’ for defections from other parties.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/07/30/1466609-ktr.jpg",
        "link": "https://www.thehansindia.com/telangana/gadwal-mla-set-to-return-to-brs-meets-ktr-895573"
    },
    {
        "title": "Stray dogs attack police in Jogulamba Gadwal, officer hospitalised",
        "author": [
            "Newstap Bureau"
        ],
        "publish_date": "2024-10-21",
        "text": "ALAMPUR: Stray dogs attacked police personnel in Alampur, where officers had gathered for VIP security duties at the Jogulamba temple. An ASI named Basha was injured in the attack and was immediately taken to the hospital for treatment.\n\nDevotees visiting the temple have raised concerns about the increasing number of stray dogs in Alampur. Many have asked authorities to take action and control the situation. Locals attribute the growing problem to dogs being abandoned by pilgrims travelling from Karnataka to Srisailam on foot, as they release the animals near the Tungabhadra River and the surrounding Nallamala forest.\n\nResidents have urged the officials to address the stray dog menace and ensure public safety in the area.",
        "top_image": "https://www.newstap.in/h-upload/2024/09/09/1652103-mad-dog-attack-injures.webp",
        "link": "https://www.newstap.in/crime/stray-dogs-attack-police-in-jogulamba-gadwal-officer-hospitalised-1555448"
    },
    {
        "title": "ASHRA Gadwal District Committee Appointments Announced: Ramu Bharath Takes Charge as District President",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-10-09",
        "text": "Gadwal: Appointment of ASHRA Gadwal District Committee, The appointment letters were handed over by ASHRA Founder and Supreme Court Advocate Havij Sultan Ali.\n\nASHRA aims to raise awareness about consumer rights and to file consumer cases whenever their rights are violated, ensuring justice is served. The organization, which started with its headquarters in Hyderabad, currently operates in 10 states, providing services with 1,000 members. As part of this initiative, the district committee members were appointed in Gadwal.\n\nIn Gadwal, Ramu Bharath has been appointed as the District President, K. Jagadeesh as the Vice President, Ravi as the Secretary, Mahesh as the Joint Secretary, and Eshwar as an Executive Member. The appointment letters were handed over by Advocate K. Shivakumar, a member of ASHRA's National Legal Committee, and the State President, N. Venkatesh Gupta, in the presence of Supreme Court Advocate Havij Sultan Ali.\n\nUpon assuming the responsibility of Gadwal District President, Sri Ramu Bharath stated that they would conduct awareness sessions on consumer rights across the district and assured that ASHRA would stand by consumers in resolving any issues. State President Sri N. Venkatesh Gupta congratulated the newly appointed members, extending special appreciation for their dedication to serving the public.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/10/09/1487727-ashra.jpg",
        "link": "https://www.thehansindia.com/telangana/ashra-gadwal-district-committee-appointments-announced-ramu-bharath-takes-charge-as-district-president-913321"
    },
    {
        "title": "BRS Party Senior Leader Nagar Doddi Venkat Ramudu Reaffirms Party 's Strength and Support In Gadwal.",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-07-29",
        "text": "Gadwal : In a stirring and well-attended gathering at the KS Function Hall in Gadwal, senior state leader of the Bharat Rashtra Samithi (BRS), Nagar Doddi Venkataramulu, delivered a powerful speech assuring the party's unwavering support for every worker in the Gadwal constituency.\n\nDuring the meeting, Venkataramulu emphasized that the BRS remains a steadfast pillar for all its dedicated workers and urged them not to lose hope amidst the current political challenges. He took the opportunity to criticize the Congress party's administration, highlighting its perceived failures and the numerous hardships faced by the people within just eight months of their governance.\n\n\n\n\n\n\"The public is yearning for the return of the BRS to power,\" Venkataramulu stated, indicating that the gathering was a strategic move to prepare for the upcoming local elections. He called for efficiency and unity within the party to strengthen their efforts and effectively confront Congress.\n\n\n\nCondemning the recent party switch by elected representatives, particularly those who had been elected under the BRS banner, Venkataramulu questioned the development promises made by those who switched allegiances. He asserted that the MLA's defection was a betrayal of the people's trust and the hard work of the BRS members.\n\n\n\nAddressing the unexpected departure of Bandla Krishnamohan Reddy, Venkataramulu reassured the audience that the BRS would soon recover and emerge stronger. The large turnout at the meeting was a testament to the enduring trust and belief in the BRS and Chief Minister KCR, despite the current adversities.\n\n\n\nHe acknowledged the dedication of hundreds of party workers who attended the meeting despite the ongoing agricultural activities and rains, highlighting the strong support base of the BRS. He stressed that no other BRS leaders had joined Congress, affirming the unity and loyalty within the party.\n\n\n\n\n\nVenkataramulu also responded to the congratulatory messages received following the MLA's party switch, describing them as insincere and merely reflective of changing circumstances. He criticized the frequent party-switching behavior of some leaders, pointing out their double standards.\n\n\n\nAssuring that the BRS leadership would not allow those who abandoned the party during tough times to return, Venkata ramulu promised fair opportunities for the loyal and hardworking members. He highlighted the party's commitment to allocating tickets to the BC community in the upcoming elections.\n\n\n\nExpressing confidence in the BRS's ability to effectively confront Congress in the local elections, Venkata ramulu emphasized the public's desire for the BRS's return to power. He criticized the Congress party's failure to fulfill its promises within eight months, citing issues such as electricity shortages, water problems, lack of subsidies, and troubles with farmer support programs.\n\n\n\nIn his concluding remarks, Venkata ramulu called on former leaders who had distanced themselves from the BRS to return and face the elections under the current leadership. He expressed his belief in the strong BRS leadership in Gadwal, predicting a victorious future for the party.\n\n\n\nThe meeting, presided over by Beechupalli, saw participation from several senior BRS leaders and coordinators, including Anantapur Jayaram Reddy, Erra Valli Ramulu, Rangu Maddiletti, Patel Janardhan Reddy, Kuruva Pallayya, advocate Damodar, Tower Makbool, advocate Ramu, BRS leader Srujana, Babu Goud, Narasimha, Krishna, and others. The overwhelming turnout and enthusiastic support from party workers and leaders underscored the BRS's robust presence and optimistic outlook for the upcoming elections.\n\n",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/07/29/1466399-whatsapp-image-2024-07-29-at-75051-pm.jpg",
        "link": "https://www.thehansindia.com/telangana/brs-party-senior-leader-nagar-doddi-venkat-ramudu-reaffirms-party-s-strength-and-support-in-gadwal-895411"
    },
    {
        "title": "Stray dogs attack continue in Telangana, six year old attacked in Gadwal",
        "author": [
            "Telangana Today"
        ],
        "publish_date": "2024-10-04",
        "text": "Stray dogs attack continue in Telangana, six year old attacked in Gadwal\n\nA group of dogs attacked the boy while he was playing in front of his house. His mother, Sirisha, had asked him to fetch a milk packet from a nearby shop. As Revanth was on his way to the shop, the dogs pounced on him, causing severe injuries. Reports indicate that he sustained injuries to his eyelids, hands, and head.\n\nBy Telangana Today Updated On - 4 October 2024, 02:26 PM\n\nRepresentational Image\n\nJogulamba Gadwal: Stray dog attacks on people, especially on children continue unabated in the State. Six year old boy Revanth was attacked at Amarvai village, Manapadu in the district on Friday and suffered several injuries.\n\nA pack of dogs attacked the boy when he was playing in front of his house. His mother Sirisha had asked the boy to get a milk packet from a nearby shop. As Revanth was heading to the shop, the dogs pounced on him and attacked, resulting in severe injuries. He suffered injuries on the eyelids, hands and head, according to reports.\n\nAfter Revanth screamed in pain, his mother and neighbours rushed to his rescue. He was immediately rushed to Government General Hospital in Kurnool and is undergoing treatment.\n\nResidents fumed that despite repeated complaints about rising stray dog menace, the municipal officials were not taking any measures to control the menace. They complained that the dogs were particularly targeting senior citizens and children.",
        "top_image": "https://media.telanganatoday.com/wp-content/uploads/2024/10/Stray-dogs-attack-continue-in-the-State-six-year-old-Revanth-attacked-at-Gadwal.jpg",
        "link": "https://telanganatoday.com/stray-dogs-attack-continue-in-the-state-six-year-old-revanth-attacked-at-gadwal"
    }
]