[
    {
        "title": "Jogulamba Gadwal: Six Sentenced to Life Imprisonment in Murder Case",
        "author": [
            "Dc Correspondent",
            "About The Author"
        ],
        "publish_date": "2024-11-28",
        "text": "Jogulamba Gadwal: The Principal District and Sessions Court in Mahabubnagar sentenced six persons to life imprisonment and imposed a fine of Rs. 3,500 each in connection with the 2016 murder of former village sarpanch Pani Kurumanna in Manopad.\n\nThe murder fueled by an ongoing feud since 2012, occurred when Kurumanna was attacked with hunting knives while on Potula Padu Road. The victim’s family alleged the crime was motivated by his role in leading witnesses in a related murder case involving the same accused.\n\nThe Manopad police under the guidance of CI P. Venkateshwarlu and SI Bhagwant Reddy conducted the investigation filing a charge sheet that led to the convictions. District SP Shri T. Srinivasa Rao IPS commended the police and legal team for ensuring justice. The convicted include Varikuntla Prasad, Varikuntla Ramanjaneyulu, Varikuntla Prakash, Varikuntla Ganga Raju, Varikuntla Garka Raju and Varikuntla Praveen.",
        "top_image": "https://www.deccanchronicle.com/h-upload/2024/11/28/1867259-hyderabad.jpg",
        "link": "https://www.deccanchronicle.com/southern-states/telangana/jogulamba-gadwal-six-sentenced-to-life-imprisonment-in-murder-case-1842019"
    },
    {
        "title": "Constitution Day and National Law Day Celebrated with Enthusiasm at Gadwal PG Center",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-11-27",
        "text": "Gadwal: Constitution Day, Samvidhan Divas, and National Law Day were celebrated with grandeur today at the PG Center in Nadi Agraharam, Gadwal. The event was graced by Chief Guest and Secretary of the Legal Services Authority, Senior Civil Judge Smt. Ghanta Kavitha Devi. Addressing the gathering, she emphasized that the Indian Constitution is superior to all religious texts and highlighted how it ensures the rights and freedoms of individuals. She also urged everyone to grow tulsi plants in the Tulsi Vanam (sacred grove) and to lead disciplined lives. Special mention was made about the need for women to progress in all fields.\n\nPresiding over the event, Principal Dr. Chavva Venkat Reddy spoke about the values enshrined in the Constitution, such as liberty, equality, and fraternity, encouraging students to achieve their life goals while upholding these principles.\n\nThe program also featured remarks from Chief Legal Aid Defense Counsel Mr. Rajender and Deputy Legal Aid Defense Counsel Mr. Srinivasulu, who highlighted the importance of legal rights and awareness.\n\nSenior faculty members, including Aravind, Dr. Mangalgiri Srinivasulu, Dr. Gopinath Rathod, Dr. Mahender, Ganesh, Mohammed Rafi, Naresh, Naveen Goud, Ghattayya, Anjaneyulu, and Lakshmaiah, actively participated in the event alongside a large number of students.\n\nThe celebration was a significant step in spreading awareness about the Indian Constitution and its values among the youth.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/11/27/1500775-pg.jpg",
        "link": "https://www.thehansindia.com/telangana/constitution-day-and-national-law-day-celebrated-with-enthusiasm-at-gadwal-pg-center-924837"
    },
    {
        "title": "Gadwal BJP Celebrates 75th Anniversary of Indian Constitution with Floral Tributes to Dr. B.R. Ambedkar",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-11-27",
        "text": "Gadwal: On the occasion of the 75th anniversary of the adoption of the Indian Constitution, a special program was organized at the BJP District Office located in DK Bungalow, Gadwal town. Dr. B.R. Ambedkar's portrait and a copy of the Constitution were adorned with floral garlands as a tribute.\n\nDistrict President Ramachandra Reddy addressed the gathering, emphasizing the uniqueness and greatness of the Indian Constitution. He remarked, “While constitutions of many countries have undergone several amendments, India’s Constitution remains resilient and continues to guide the nation as envisioned by Dr. Ambedkar. This is a testament to the brilliance of Dr. Ambedkar and the strength of our country. Many nations admire the Indian Constitution for its revolutionary approach.”\n\nHe further highlighted, “The Indian Constitution is a visionary document aimed at the comprehensive development of the nation. Dr. B.R. Ambedkar dedicated his time, intellect, and even sacrificed his health for the drafting of this remarkable Constitution.”\n\nThe event concluded with District General Secretary Ravikumar Ekbote leading all participants in a collective reading of the Preamble to the Constitution.\n\nProminent attendees included former Assembly Convener Ramanjaneyulu, Town President Bandala Venkata Ramulu, District OBC Morcha President Deva Das, State BJYM Committee Member Delhiwala Krishna, BJYM District Leaders Kottala Veeresh Reddy, Town Vice President Pandu Reddy, OBC Morcha Vice President Dabbileti Narasimha, senior BJP leaders Geeta Reddy, Mohan Reddy, Ramesh, and Kurvapalli Srinu, among others.\n\nThe program was a solemn and inspirational tribute to Dr. Ambedkar and the values enshrined in the Indian Constitution.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/11/27/1500771-bjp.jpg",
        "link": "https://www.thehansindia.com/telangana/gadwal-bjp-celebrates-75th-anniversary-of-indian-constitution-with-floral-tributes-to-dr-br-ambedkar-924835"
    },
    {
        "title": "Gas Cylinder Subsidy Issues: Residents Urged to Ask Revanth Reddy for Answers",
        "author": [
            "Safiya Begum"
        ],
        "publish_date": "2024-11-26",
        "text": "Telangana: Tensions erupted in Ayiz, a town in Gadwal district, when locals confronted staff at the Shri Lakshmi Narasimha Gas Agency regarding the delayed subsidy payments for gas cylinders. The residents complained that the promised subsidy of Rs. 500 on LPG cylinders had not been credited to their accounts, causing frustration and inconvenience.\n\nWhen the customers raised the issue with the agency staff, they were reportedly told to take the matter up with Revanth Reddy, the Member of Parliament (MP) from the area. According to sources, the gas agency staff deflected the blame, suggesting that the residents go and speak to Reddy if they had concerns about the subsidy payments.\n\nThis response did not sit well with the locals, who were expecting the subsidy as promised under the government’s welfare scheme. The residents questioned the accountability of local authorities in ensuring that subsidies reach the people without delay.\n\nIn Ayiz, Gadwal district, locals raised concerns over delayed Rs. 500 LPG cylinder subsidies. When they confronted the Shri Lakshmi Narasimha Gas Agency staff, they were told, \"Go and ask Revanth Reddy\" for answers. pic.twitter.com/uRuLyQP4HT — The Munsif Digital (@munsifdigital) November 26, 2024\n\nThe incident highlights ongoing concerns regarding the efficient delivery of government schemes in rural areas, with residents urging more transparency and quicker action to resolve such issues. The situation has led to growing discontent among the beneficiaries who feel they are being passed between various authorities without clear resolutions.\n\nAs the issue continues to unfold, locals are waiting for a response from both the gas agency and their elected representatives to ensure that the gas cylinder subsidies are processed without further delays.",
        "top_image": "https://2c31032a.delivery.rocketcdn.me/wp-content/uploads/2024/11/GAS-AGENCY.jpg",
        "link": "https://munsifdaily.com/gas-cylinder-subsidy-issues-residents-urged-to-ask-revanth-reddy-for-answers/"
    },
    {
        "title": "Archaka Maha Sabha in Jogulamba Gadwal District Highlights Key Demands for Priests' Welfare",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-11-24",
        "text": "Gadwal: In a significant gathering, the Archaka Maha Sabha was held at the Sri Sri Sri Veerabrahmendra Swamy Temple premises in Ieeja Mandal, Jogulamba Gadwal District. This was the first meeting after Chakravarti Acharyulu was elected as the Dhupa Deepa Naivedya District President of Jogulamba Gadwal. Archakas honored him with garlands in recognition of his leadership.\n\nThe event was presided over by Chakravarti Acharyulu and attended by the United District Vice-President Ashok Acharyulu. During the meeting, the Archakas discussed continuing their daily services to the deities and highlighted several demands to be presented to the government.\n\nKey Demands Presented by Archakas:\n\n1. Increase in Minimum Salary: The previous BRS government had provided nominal salaries to temple priests. The Archakas urged the current Congress government to increase the minimum salary to ₹22,000.\n\n2. Housing: Archakas without proper housing requested the allocation of land under government schemes like Indiramma Housing.\n\n3. Job Security: Archakas emphasized the need for permanent employment safeguards.\n\n4. Healthcare Benefits: The priests requested free medical treatment for themselves and their family members in case of health issues.\n\n5. Welfare Schemes: Archakas sought access to various government welfare schemes and demanded pressure on the government to ensure their inclusion.\n\n6. Security for Archakas: The priests highlighted the importance of providing security to temple staff.\n\nThe meeting concluded with a call for every Archaka to participate in the submission of memorandums to the government for these demands.\n\nAppointments of Mandal In-Charges:\n\nThe following appointments were announced for various mandals in the district:\n\nGattu Mandal In-Charge: Jangam Paramesh,\n\nMaldakal Mandal In-Charge: Guru Venkataswamy,\n\nIeeja Mandal In-Charge: Nagaraju,\n\nRajoli Mandal In-Charge: Adavi Swamy,\n\nGadwal Mandal In-Charge: Naresh Swamy,\n\nThe meeting saw active participation from Archakas across the district and was attended by key officials, including United District Vice-President Ashok Acharyulu, United District Secretary Sekharayya Swamy, Gadwal District Honorary President Raghu Sharma, and Panchikala Padu Shiva.\n\nThis Maha Sabha underscored the need for government support and the unity of temple priests in addressing their challenges and achieving their goals.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/11/24/1500115-archaka-maha-sabha.jpg",
        "link": "https://www.thehansindia.com/telangana/archaka-maha-sabha-in-jogulamba-gadwal-district-highlights-key-demands-for-priests-welfare-924216"
    },
    {
        "title": "GHMC Mayor orders shut down of chicken market in Hyderabad’s Esamiya Bazaar",
        "author": [
            "News Desk"
        ],
        "publish_date": "2024-11-22",
        "text": "Hyderabad: APC chicken market in Hyderabad’s New Moti Nagar was raided by Greater Hyderabad Municipal Corporation (GHMC) Mayor Gadwal Vijayalaxmi on Friday, November 22. Following the raid, the Mayor ordered a temporary closure of the market, citing severe hygiene violations.\n\nThe Mayor was accompanied by MLC Balmuri Venkat, on her surprise visit to the chicken market in Esamiya Bazaar, New Moti Nagar, Koti.\n\nThe Greater Hyderabad Mayor found a staunch smell reeking from the chicken market, and meat being kept for sale in highly unhygienic conditions. She also took note of compliance with quality standards and legality.\n\nEnraged by the findings, the Mayor ordered to temporarily seal off the wholesale chicken market, by directing the zonal commissioner to initiate the proceedings immediately.\n\nThe neighbourhood’s medical officer was ordered by the GHMC Mayor to clean all the surrounding areas in coordination with the entomology and sanitation officers.\n\nGHMC Mayor raids restaurants in Hyderabad\n\nLast week, GHMC Mayor Vijayalaxmi conducted surprise inspections at two popular restaurants in the city. During the inspections at Mughal Restaurant in Lakdikapul and Dine Hill Hotel in Masab Tank, violations were found, prompting her to issue a strong warning to restaurant and hotel owners.\n\nThe Mayor reminded the restaurant management that strict measures would be enforced against establishments that fail to meet hygiene standards.\n\nAdditionally, she announced that any hotels or restaurants operating without proper food and trade licenses would face immediate penalties, including possible shutdowns.\n\nGHMC has recently ramped up measures to improve food hygiene in the city, with the corporation officials and district authorities also conducting awareness campaigns to educate food vendors and raids across eateries in Hyderabad and other parts of Telangana. Street vendors participating in these initiatives are provided with free hygiene kits, including aprons, head caps, and gloves, to encourage safe food handling practices.\n\nDespite ongoing efforts by Hyderabad’s food safety teams, violations continue to be found in some restaurants in Hyderabad. These inspections are part of a broader initiative to maintain the quality and cleanliness of food provided to the public.\n\nBy holding restaurants accountable, the Mayor aims to reassure citizens that the city is committed to improving dining conditions across Hyderabad.",
        "top_image": "https://cdn.siasat.com/wp-content/uploads/2024/11/APC-Chicken-Market-in-Hyderabad-raided-by-GHMC-Mayor.jpg",
        "link": "https://www.siasat.com/ghmc-mayor-orders-shut-down-of-chicken-market-in-hyderabad-esamiya-bazaar-3135781/"
    },
    {
        "title": "Assistant Engineer of Panchayat Raj department in Gadwal district held for graft",
        "author": [
            "Authors"
        ],
        "publish_date": "2024-11-18",
        "text": "The Mahabubnagar Unit of the Anti-Corruption Bureau (ACB) apprehended an Assistant Engineer of the Panchayat Raj department in Gadwal district on Monday while he was accepting a bribe of ₹50,000.\n\nAccording to the ACB, the engineer, identified as Pandu Ranga Rao, demanded the bribe from a complainant in exchange for recording the measurement book and forwarding the bill for the construction of a minority community hall.\n\n“The ACB recovered the bribe amount from the engineer’s possession and conducted a chemical test on his hands and pockets, which yielded positive results,” read a release from the agency.\n\nThe accused was subsequently arrested and produced before the Special Court for SPE and ACB cases in Nampally, Hyderabad.\n\nThe ACB urged the public to report any instance of bribery or corruption by public servants to their toll-free number 1064. The identity of the complainant will be kept confidential.",
        "top_image": "https://www.thehindu.com/theme/images/og-image.png",
        "link": "https://www.thehindu.com/news/national/telangana/assistant-engineer-of-panchayat-raj-department-in-gadwal-district-held-for-graft/article68881880.ece"
    },
    {
        "title": "Assistant engineer in Gadwal held for taking bribe",
        "author": [
            "News Desk"
        ],
        "publish_date": "2024-11-18",
        "text": "Hyderabad: An assistant engineer in the panchayat raj department at Itikyal Mandal, Gadwal, Pandu Ranga Rao was arrested by the Anti-Corruption Bureau (ACB) for allegedly demanding and accepting a bribe of Rs. 50,000.\n\nThe accused allegedly asked the complainant for the bribe in exchange for processing the measurement book and forwarding the bill for minority community hall work.\n\nThe bribe amount was recovered from the accused and chemical tests on his fingers and pocket confirmed the presence of the money.\n\nThe accused was produced before the Special ACB Court in Nampally and remanded to judicial custody.\n\nCitizens can report any instances of bribery in Telangana at the toll-free hotline 1064.\n\nOn November 14, the Telangana Anti-Corruption Bureau (ACB) arrested the sub-inspector and the police writer of Lingampet police station in Kamareddy district.\n\nThe arrested police officers are Lingampet sub-inspector Pabba Arun and constable cum police writer Thota Rama Swamy. They were found taking a bribe amount of Rs 10,000 by the officials, with the chemical test for bribe money turning positive.\n\nIn a similar incident of corruption by Telangana police officers, On November 8, the SI of Varni police station in Nizamabad district was arrested by the Telangana ACB officers.\n\nSub-inspector Krishna Kumar was arrested for accepting a bribe of Rs 20,000 in exchange for granting station bail to an individual arrested for physical assault.\n\nAccording to officials from the ACB, the complainant, Nagaraju, a farmer, was arrested by the Varni police on November 4 for his involvement in a physical fight, to grant bail for which the officer demanded a bribe and was later nabbed.",
        "top_image": "https://cdn.siasat.com/wp-content/uploads/2024/11/Tamreen-25.jpg",
        "link": "https://www.siasat.com/assistant-engineer-in-gadwal-held-for-demanding-accepting-bribe-3133623/"
    },
    {
        "title": "Mission Bhagiratha Pipeline Leaks, Wasting Water in Gadwal District",
        "author": [
            "Fouzia Farhana"
        ],
        "publish_date": "2024-11-15",
        "text": "Gadwal: A significant incident of water wastage has occurred in Gadwal district, where a section of the Mission Bhagiratha pipeline has burst, resulting in large amounts of water flowing wastefully into the open. The pipeline ruptured near Kothula Gidda Stage in Dharur Mandal, causing a visible spill of water that could have been better utilized.\n\nMission Bhagiratha Pipeline Burst\n\nThe pipeline, part of the Mission Bhagiratha project aimed at providing safe drinking water to rural areas across Telangana, suffered a major rupture, leading to water gushing out in a steady stream. Locals have expressed concerns about the damage and the environmental impact of the water loss.\n\nAlso Read: Confidential Family Survey Documents Found Discarded on Road in Medchal\n\n“Water is a precious resource, and it is disheartening to see so much of it being wasted due to such technical failures. The government needs to address these issues immediately,” said a resident of the area.\n\nImpact on Water Supply and Local Communities\n\nThe Mission Bhagiratha project, launched by the Telangana government, is intended to supply drinking water to rural areas, but incidents like this pipeline burst raise questions about the reliability and maintenance of the infrastructure. While the pipeline rupture has been quickly reported, immediate repairs are necessary to prevent further wastage and disruption in water supply.\n\nThe rupture has also affected the nearby localities that depend on the water supply for daily use. Locals have urged authorities to address the problem urgently to restore water access.\n\nGovernment Response and Repairs Underway\n\nOfficials from the Telangana Drinking Water Supply and Sanitation Department (TDWSSD) have been alerted about the situation, and repair work has reportedly begun. The government has committed to resolving the issue swiftly to ensure that residents of Dharur Mandal and surrounding areas continue to receive their regular water supply.\n\n“We are aware of the leak in the Mission Bhagiratha pipeline near Kothula Gidda and are taking immediate steps to repair the damage. Our teams are on the ground to fix the issue and prevent further wastage,” said a government official.\n\nCall for Better Maintenance and Infrastructure Upgrades\n\nThe incident has sparked concerns about the overall maintenance and longevity of the Mission Bhagiratha pipeline network, especially as the state pushes forward with water supply projects in rural areas. Experts have stressed the need for regular inspections and timely repairs to avoid such issues in the future.\n\nWith water conservation becoming an urgent priority in many regions, ensuring the efficiency of large-scale water supply projects like Mission Bhagiratha is essential for meeting the needs of rural communities across Telangana.\n\nConclusion\n\nWhile the pipeline burst in Gadwal district highlights the challenges of maintaining vast infrastructure projects, the Telangana government’s quick response aims to minimize the damage. As work on repairs continues, authorities are working to ensure that the water wastage is stopped and that the supply remains uninterrupted for the affected communities.",
        "top_image": "https://2c31032a.delivery.rocketcdn.me/wp-content/uploads/2024/11/WATERWASTE.jpg",
        "link": "https://munsifdaily.com/mission-bhagiratha-pipeline-leaks-wasting-water-in-gadwal-district/"
    },
    {
        "title": "New Bharosa Centres Launched in Mahbubnagar and Jogulamba Gadwal Districts",
        "author": [
            "Dc Correspondent",
            "About The Author"
        ],
        "publish_date": "2024-11-13",
        "text": "Hyderabad: The police women safety wing (WSW) opened a Bharosa centre for Mahbubnagar district while a building was inaugurated for the existing unit at the Jogulamba Gadwal district. The Bharosa Centres, managed by the Society for Protection of Women and Children, with WSW DGP Shikha Goel as member-secretary, offers specialised support for victims. Each centre, staffed with professionals including counsellors, psychologists, legal officers, and medical personnel, ensures comprehensive care.",
        "top_image": "https://www.deccanchronicle.com/h-upload/2024/11/12/1862088-bharosa.jpg",
        "link": "https://www.deccanchronicle.com/southern-states/telangana/new-bharosa-centres-launched-in-mahbubnagar-and-jogulamba-gadwal-districts-1837710"
    },
    {
        "title": "Bharosa centres inaugurated at Mahabubnagar, Jogulamba Gadwal districts",
        "author": [
            "Telangana Today"
        ],
        "publish_date": "2024-11-12",
        "text": "Bharosa centres inaugurated at Mahabubnagar, Jogulamba Gadwal districts\n\nThese centres will provide assistance to victims of crime against women and children through dedicated single-window support centres\n\nBy Telangana Today Published Date - 12 November 2024, 07:17 PM\n\nHyderabad: Two Bharosa centres were inaugurated at Mahabubnagar and Jogulamba Gadwal districts in the State on Tuesday.\n\nThese centres will provide assistance to victims of crime against women and children through dedicated single-window support centres. “The services offered to survivors include counselling, legal aid, medical assistance, rehabilitation and other essential services,” said DG Women Safety Wing, Shikha Goel.\n\nSince May 2016, Telangana police has started 27 Bharosa centres across the State. In the first half of this year, 14 new centres were inaugurated in Jagityal, Bhadradri Kothagudem, Jangaon, Mancheriyal, Mulugu, Nagarkurnool, Peddapally, Jayashanker Bhupalpally, Kamareddy, Rajanna Sircilla, Kumarambheem Asifabad, Narayanpet, Nirmal and Wanaparthy.\n\nShikha Goel said Bharosa centres, managed by Bharosa – Society for Protection of Women and Children- offer specialized support for victims. Each centre, staffed with professionals including counsellors, psychologists, legal officers, and medical personnel, ensures comprehensive care.\n\n“The vision also encompasses addressing modern crimes against women and children, with every centre having a woman police officer and medical officer for holistic assistance,” said the official.\n\nSince inception, these centres have aided 5,852 related to Protection of Children from Sexual Offenses (POCSO) and 1447 rape cases, demonstrating their pivotal role in enabling justice and rehabilitation.",
        "top_image": "https://media.telanganatoday.com/wp-content/uploads/2024/11/Bharosa.jpg",
        "link": "https://telanganatoday.com/bharosa-centres-inaugurated-at-mahabubnagar-jogulamba-gadwal-districts"
    },
    {
        "title": "Telangana: New Bharosa centres opened in Mahabubnagar, Gadwal",
        "author": [
            "News Desk"
        ],
        "publish_date": "2024-11-12",
        "text": "Hyderabad: The Telangana Police Women Safety Wing opened new Bharosa centres on Tuesday, November 12, with a new centre being inaugurated in Mahabubnagar district and an already existing centre moving into a newly built independent building in Jogulamba Gadwal district.\n\nBharosa centres are operated by the women’s safety department of the police to assist survivors of rape and sexual abuse. The centres provide medical treatment and checkups, counselling, and support to the survivors in filing complaints and also provide the necessities for the rehabilitation of the victims.\n\nThe Bharosa centres that provide medical, legal, and mental aid to women and children to overcome the trauma of sexual abuse and rape were inaugurated in 14 districts in the first half of 2024. The new centres were opened in Jagityal, Bhadradri Kothagudem, Jangaon, Mancheriyal, Mulugu, Nagarkurnool, Peddpally, Jayashanker Bhupalpally, Kamareddy, Rajanna, Sircilla, Kumarambheem Asifabad, Narayanpet, Nirmal and Wanaparthy districts.\n\nThe initiative was first set up with one centre in Hyderabad in 2016, and upon the pilot project’s overwhelming success, it was widened step by step, and now has expanded into 27 centres across the state.\n\nAccording to the police, since its establishment in 2016, the Bharosa project has helped 5852 victims related to Protection of Children from Sexual Offenses (POCSO) and 1447 adult rape victims.\n\nThe permanent state-of-the-art buildings have been constructed and made operational through the\n\nCSR funding received from MEIL.\n\nEach centre is staffed with professionals including counsellors, psychologists, legal officers, and medical personnel, ensuring comprehensive care.\n\nAlso Read Hyderabad police busts international human trafficking ring, rescue 3 women\n\nWork at Bharosa centres and support survivors\n\nTelangana’s Bharosa centres are currently hiring for female-only positions including support persons, legal counsellors, complaints processing executives, health workers, counsellors, psychologists, help desk executives, receptionists, data entry operators, accountants, Bharosa centre coordinators, and more.\n\nThere are no application fees. Interested candidates can apply via the Bharosa Centre’s official website.",
        "top_image": "https://cdn.siasat.com/wp-content/uploads/2024/11/Bharosa-Centre-in-Telangana.jpg",
        "link": "https://www.siasat.com/telangana-new-bharosa-centres-opened-in-mahabubnagar-gadwal-3130439/"
    },
    {
        "title": "Prajavani to Solve People's Problems: GHMC Mayor Gadwal Vijayalakshmi",
        "author": [
            "Bizz Buzz"
        ],
        "publish_date": "2024-11-11",
        "text": "Hyderabad: GHMC Mayor Gadwal Vijayalakshmi today said prajavani programme was aimed at solving the problems of the people. The Mayor directed the concerned officials to take the initiative to look into the complaints received in the public domain and resolve them immediately.\n\n\n\nThe Mayor and the Deputy Mayor Mote Srilatha Sobhan Reddy along with the people from all over the city received grievances for the prajavani held at the GHMC headquarters on Monday. The complaints were handed over to the concerned authorities and the issues were ordered to be resolved.\n\nSpeaking on the occasion, Mayor Gadwal Vijayalakshmi directed the officials to resolve the complaints received in the public domain from time to time without any delay. The petitioners were told that any problem should be brought to their notice and efforts would be made to resolve the issue by her. She also suggested that the right way to resolve the issues should be found and added that the petitioners should not be turned around the office and steps would be taken to resolve the grievances of the petitioners at the earliest. The petitioners have been asked to exercise restraint by her.\n\nFour requests were received through the phone-in programme and were sent to the concerned authorities for redressal. Deputy Mayor Srilatha Sobhan Reddy said the authorities should make special efforts in resolving the grievances of the petitioners. She instructed the officials to take steps to ensure speedy justice to the requests from time to time. Of the 43 requests received in the Prajavani programme held at the GHMC headquarters, the Town Planning department received the highest number of complaints at 26, followed by health (4), ENC department (3), tax section, UBD and FA departments (2 each) and legal, lakes, HMWSSB, LWSB, LWS and S departments one each.\n\nA total of 103 applications were received in the six zones under the GHMC limits. Of these, 62 complaints were received in Kukatpally zone, 19 in Serilingampally zone, 11 in LB Nagar zone, four in Secunderabad zone, four in Khairatabad zone and three in Charminar zone.\n\nAdditional Commissioners Shiva Kumar Naidu, Nalini Padmavathi, Yadagiri Rao, Venugopal Reddy, Geetha Radhika, Pankaja, Ashok Samrat, Raghu Prasad, Subhadra Devi, CCP Srinivas, CE Bhaskar Reddy, Additional CCP Gangadhar, Lakes SE Narayana, CM&HO Dr Padmaja, Veterinary Chief Dr Abdul Vakil, Joint Commissioners Mahesh Kulkarni, Uma Prakash, Vanisree, Water Works D G Housing SE Krishna Rao, PV Ramana, Rajeshwar, UBD Director\n\nSrinivas and Advertising Officer Durdana Begum were present.",
        "top_image": "https://www.bizzbuzz.news/h-upload/2024/11/11/1942884-ghmc-mayor.jpg",
        "link": "https://www.bizzbuzz.news/news-capsules/prajavani-to-solve-peoples-problems-ghmc-mayor-gadwal-vijayalakshmi-1341911"
    },
    {
        "title": "Jogulamba Gadwal District Establishes Vishwa Hindu Parishad Dharma Prasara District Committee",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-11-11",
        "text": "A meeting was held in Jogulamba Gadwal district to establish the Dharma Prasara District Committee of the Vishwa Hindu Parishad (VHP). Key topics discussed in the meeting included spreading awareness about Dharma, addressing the risks associated with religious conversions, facilitating homecoming (re-conversion) programs, conducting satsangs, and outlining the committee's responsibilities and planned tours.\n\nThe event saw the participation of notable figures including R. Jagadishwar Reddy, Narasimhulu, Sudhakar, VHP District Co-Secretary Manoj Kumar Reddy, District Satsang Co-Leader Parusharam, and members of the Dharma Prasara Committees from Dharur and Maldakal mandals.\n\n\n\n\n\nDelete Edit\n\n\n\n",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/11/11/1496056-b.jpg",
        "link": "https://www.thehansindia.com/telangana/jogulamba-gadwal-district-establishes-vishwa-hindu-parishad-dharma-prasara-district-committee-920668"
    },
    {
        "title": "Jogulamba Gadwal Police Rank 5th in State for Mobile Recovery through CEIR Portal",
        "author": [
            "M Veeresh Veeresh"
        ],
        "publish_date": "2024-11-06",
        "text": "Gadwal: Jogulamba Gadwal District Ranks 5th in the State for Mobile Recovery through CEIR Portal State DGP Dr. Jitender, IPS, Commends the Police Force\n\nThe Jogulamba Gadwal District Police have shown exemplary performance in recovering stolen and lost mobile phones, earning recognition from Telangana State DGP Dr. Jitender, IPS, who presented them with a Certificate of Appreciation on Tuesday. From April 2023 to October 2024, the district police identified and recovered 948 mobile phones and returned them to their rightful owners. In recognition of this achievement, DGP Dr. Jitender, IPS, praised District SP T. Srinivas Rao, IPS, along with district police officers and staff. The Certificate of Appreciation was handed over to IT Cell in-charge SI Smt. Rajitha by the DGP.\n\nOn this occasion, the District SP highlighted the efforts to curb mobile theft by utilizing the Department of Telecommunications’ CEIR (Central Equipment Identity Register) portal, which has yielded excellent results. SP Srinivas Rao urged the public to promptly report lost or stolen mobiles by blocking them on the CEIR portal and notifying the relevant police station. SP Srinivas Rao commended the district police team for their efforts, which have secured Jogulamba Gadwal District the 5th position in mobile recovery across the state.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/11/06/1494781-ceir.jpg",
        "link": "https://www.thehansindia.com/telangana/jogulamba-gadwal-police-rank-5th-in-state-for-mobile-recovery-through-ceir-portal-919451"
    },
    {
        "title": "BRS Leaders Demand Justice for Minor Girl’s Death in Gadwal, Urge Action Against Seed Organizer",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-11-05",
        "text": "Gadwal: Telangana: Senior Bharat Rashtra Samithi (BRS) leaders, including Dr. RS Praveen Kumar and former state minister Srinivas Goud, Nagar Doddi Venkatramudu , Anjaneyulu Goud,NHPS Ranjit Kumar have voiced strong demands for justice following the tragic death of Vaddera Rajeshwari, a minor girl from Bijwaram village, Maldakal Mandal. Rajeshwari reportedly took her own life after alleged harassment and false accusations of theft by her employer, a prominent local seed organizer.\n\nThe incident has sparked widespread public and political outcry, with allegations of police negligence and favoritism due to the accused’s influential connections. According to reports, Rajeshwari was employed as a domestic worker at the home of Bandla Rajasekhar Reddy, a known seed organizer in Gadwal. The family and BRS leaders allege that Reddy accused her of theft, pressuring her under the weight of unsubstantiated claims. Unable to bear the humiliation, Rajeshwari is said to have consumed pesticide, which led to her tragic death.\n\nBRS leaders, along with activists from the Nadigadda Rights Struggle Committee, visited Rajeshwari’s family to offer condolences and pledged their support in seeking justice. During the visit, Dr. RS Praveen Kumar condemned the alleged mistreatment of the minor girl and criticized the police for initially omitting Reddy’s name from the First Information Report (FIR). He accused local law enforcement of showing bias by protecting the accused due to his political influence.\n\nAddressing the media, Dr. Kumar called for immediate and strict action against Reddy, along with an impartial investigation into the role of\n\nlocal police officers who allegedly mishandled the case. \"We will not rest until those responsible for this innocent girl's death are brought to justice,\" he stated, adding that justice for Rajeshwari should serve as a deterrent to prevent the exploitation of minors in the future.\n\nFormer minister Srinivas Goud echoed these sentiments, demanding that Reddy be held accountable for his actions. \"Exploitation and abuse of vulnerable communities cannot be tolerated. We will ensure this case does not go ignored,\" he said.Local activists and leaders from multiple organizations held a rally in support of Rajeshwari's family, urging authorities to investigate the broader influence of seed organizers in the district. They argue that some powerful figures use their connections to avoid accountability, further marginalizing vulnerable groups.\n\nThe BRS leaders also highlighted the need for stronger protections for minors, calling on the government to address the prevalence of child labor and exploitation in rurallabor and exploitation in rural areas. They expressed concerns that Rajeshwari's case represents broader issues facing marginalized families in Telangana, urging the state to implement policies to protect children from similar fates.\n\nAs the case continues to unfold, calls for a fair and transparent investigation grow louder, with the BRS leadership pledging to pursue justice relentlessly. Rajeshwari's death has not only brought attention to her personal tragedy but has also sparked a wider Conversation about child exploitation and power dynamics, and police accountability.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/11/05/1494517-whatsapp-image-2024-11-05-at-65753-am.jpg",
        "link": "https://www.thehansindia.com/telangana/brs-leaders-demand-justice-for-minor-girls-death-in-gadwal-urge-action-against-seed-organizer-919193"
    },
    {
        "title": "Gadwal: Five nabbed for online betting",
        "author": [
            "The Hans India"
        ],
        "publish_date": "2024-11-05",
        "text": "Gadwal: The Aija police have arrested five individuals for engaging in online betting. This operation was initiated following information received by the Special Branch police. Acting on the orders of District SP T Srinivasa Rao, and under the supervision of Special Branch Inspector Nageshwar Reddy, a joint team led by Ijay Sub-Inspector Vijay Bhaskar monitored the situation.\n\nDuring the operation, the police identified the individuals involved in online betting, seizing cash amounting to Rs 1,04,860 and five mobile phones from them. Subsequently, a case was registered against the accused at the Ijay police station by SI Vijay Bhaskar.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/10/30/1493257-arrest.jpg",
        "link": "https://www.thehansindia.com/telangana/gadwal-five-nabbed-for-online-betting-919221"
    },
    {
        "title": "Gadwal MLA Inaugurates Grand Rathotsavam of Pagunta Venkanna Swami with Devotees.",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-11-02",
        "text": "Gadwal : Grand Celebration of Pagunta Venkanna Swami Rathotsavam MLA Participates in the Rathotsavam Special Poojas for Sri Sri Sri Lakshmi Venkateshwara Swami Today, on the occasion of the Brahmotsavam and annual festival of Sri Sri Pagunta Lakshmi Venkateshwara Swami in KT Doddi Mandal of Gadwal constituency, Gadwal MLA Bandla Krishna Mohan Reddy visited the temple, offered special poojas to the deity, and received blessings.\n\nAfter the rituals, the MLA conducted poojas for the chariot and personally initiated the Rathotsavam by pulling the chariot to commence the festival.\n\nAddressing the gathering, the MLA said:\n\n“The festive season of Telangana has begun. The Brahmotsavam (annual festival) of Sri Sri Sri Pagunta Lakshmi Venkateshwara Swami has started in Venkatapuram village of KT Doddi Mandal, Jogulamba Gadwal district. From today, the festive spirit will spread across Telangana.”\n\nWith the blessings of Sri Lakshmi Venkateshwara Swami, I sincerely pray that all farmers and citizens be blessed with health, prosperity, and peace, thriving with abundant crops and happiness for many years to come.\n\nHe assured that all arrangements have been made to provide every facility for the devotees attending the festival.\n\nParticipating in the program were Agricultural Market Committee Chairman Kurava Hanumanthu, Senior Congress leader Gaddam Krishna Reddy, former MPP Vijay, former Sarpanch Anjaneyulu, leaders Chakradhar Rao Urukundu, Naveen Reddy, Yugandhar Goud, Rajesh, Chandrasekhar Reddy, Gopal Reddy, Chandrasekhar, Amaresh, Gopi, Shekhar Reddy, Pawan Reddy, Govindu, other leaders, activists, and youth members.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/11/02/1494012-untitled-1.jpg",
        "link": "https://www.thehansindia.com/telangana/gadwal-mla-inaugurates-grand-rathotsavam-of-pagunta-venkanna-swami-with-devotees-918797"
    },
    {
        "title": "Saritha Tirupatiah Extends Diwali Greetings to CM Revanth Reddy, Advocates for Gadwal's Development",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-11-01",
        "text": "Gadwal: On the occasion of Diwali, Chief Minister Revanth Reddy received warm greetings from Nagarkurnool Member of Parliament Dr. Mallu Ravi, former ZP Chairperson and Gadwal Constituency Congress In-charge Saritha Tirupatiah, along with other dignitaries. Saritha Tirupatiah met with the Chief Minister to extend festive wishes, hoping for a brighter future for Gadwal, with the Diwali lamps symbolizing the removal of darkness and the ushering in of positive change for the region.\n\nDuring the meeting, Saritha expressed her vision of replacing the \"darkness\" of the past decade with the \"light\" of good governance, aiming to bring significant development and welfare to Gadwal and Telangana. She urged the Chief Minister to lead initiatives that will fill the lives of the people with renewed hope and prosperity. Also present at the meeting were Minister Seethakka, Achampet MLA Chikudu Vamsikrishna, and other prominent leaders.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/11/01/1493780-saritha.jpg",
        "link": "https://www.thehansindia.com/telangana/saritha-tirupatiah-extends-diwali-greetings-to-cm-revanth-reddy-advocates-for-gadwals-development-918579"
    },
    {
        "title": "Uppari Rajasekhar Sagara from Gadwal Selected for All India Inter-University Taekwondo Championship",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-10-31",
        "text": "Gadwal: Another shining talent has emerged from the Sagara community in Gadwal district. Uppari Rajasekhar Sagara, the son of Uppari Pedda Rangaswamy Sagara from Bingidoddi village, has been selected to represent Osmania University in the upcoming All India Inter-University Taekwondo Championship, which will be held at Guru Nanak University in Amritsar, Punjab, from November 6 to 9.\n\nRajasekhar will be guided and mentored by coaches Navdeep Sagara and Pradeep Sagara (from Aiza). The President of the Sagara Association in Gadwal district, Uppari Mirapakaya Venkatesh Sagara, along with senior association members, honored Rajasekhar for his accomplishment.\n\nM. Veeresh, one of the association members, expressed his pride in Rajasekhar’s achievement and encouraged the youth from the Sagara community to excel not only in academics but also in self-defense skills like Karate, Kung Fu, and Taekwondo. He motivated them to pursue careers in the country's defense services, including the Police, Military, Air Force, and Navy, and extended his best wishes for their bright future in serving the nation.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/10/31/1493641-uppari.jpg",
        "link": "https://www.thehansindia.com/telangana/uppari-rajasekhar-sagara-from-gadwal-selected-for-all-india-inter-university-taekwondo-championship-918440"
    },
    {
        "title": "Drone Survey Launched for Comprehensive Master Plan in Gadwal Municipality",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-10-29",
        "text": "Gadwal: Gadwal District Collector B.M. Santosh announced that a master plan for Gadwal Municipality is underway through a comprehensive drone survey.\n\nOn Tuesday, in the premises of the Collectorate, the drone was inaugurated by Municipal Chairperson B.S. Keshavalu along with municipal officials and Survey of India officers under the supervision of DTCP (Directorate of Town and Country Planning) officials. The inauguration included a ceremonial puja to mark the launch of the drone survey initiative.\n\nDuring the event, the District Collector emphasized that this master plan is part of a larger development initiative aimed at addressing municipal challenges and ensuring the city’s infrastructure is well-planned for future generations. He stated that the goal is to make the information available in digital form for future reference. As part of the central government’s AMRUT 2.0 scheme, Gadwal is among 20 selected municipalities in Telangana where GIS-based planning is being implemented through digital master surveys.\n\nCollector Santosh explained that the Gadwal master plan would be developed using the latest technology and detailed drone camera surveys. The data will be collected section-wise, creating base maps with comprehensive visual documentation. The precise mapping gathered through drone surveys will allow for an in-depth analysis of buildings, roads, water resources, parks, and sewage systems, facilitating maintenance and development through integrated planning.\n\nThe collector and team reviewed the drone survey process on a computer, learning how the drone covers the entire municipality, processes the collected data, and how to utilize the survey’s insights. The collector expressed confidence that this digital master plan survey would significantly contribute to the development of Gadwal town.\n\nThe program saw the participation of DTCP Additional Director Ramesh Babu, Municipal Commissioner Dasharath, Town Planning Officer Kurmanna, officials from the Survey of India, DTCP officials, and municipal staff.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/10/29/1493126-drone.jpg",
        "link": "https://www.thehansindia.com/telangana/drone-survey-launched-for-comprehensive-master-plan-in-gadwal-municipality-917962"
    },
    {
        "title": "Justice Demanded for Minor Girl's Death: Nadigadda Rights Struggle Committee Leads Rally in Gadwal",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-10-29",
        "text": "Gadwal: In a powerful display of solidarity, members of the Nadi gadda Rights Struggle Committee held a large rally to honor Vadde Rajeswari, a minor girl from Bijwaram village in Maldakal Mandal, who died under distressing circumstances. The rally, led by District Chairman Gongalla Ranjith Kumar, began at the Nadi gadda Rights Struggle Committee office and proceeded to the Krishnaveni Chowrasta in Gadwal.\n\nCommittee leaders and activists paid tribute to Rajeswari, holding her photograph and lighting candles in her memory.During the event, Chairman Gongalla Ranjith Kumar stated that Rajeswari's death was a tragic result of her inability to cope with the humiliation she faced. Allegedly wrongfully accused of theft, she reportedly ingested pesticide in an attempt to end her life. She later succumbed to the effects of the poison. Ranjith Kumar strongly demanded immediate legal action against prominent seed organizer Bandla Rajasekhar Reddy, whom he claims is responsible for Rajeswari's death. According to Kumar, Rajeswari was wrongfully implicated in a theft case, and despite her repeated denials, police at the Maldakal Police Station continued to pressure her, failing to consider her age or the impact on her family. He alleged that Rajasekhar Reddy, who has avoided arrest, manipulated the system with his political influence to evade accountability.\n\nRanjith Kumar emphasized that there are multiple layers to the circumstances surrounding Rajeswari's death, calling for an impartial investigation into all angles of the case anddemanding Rajasekhar Reddy's arrest and strict punishment. He announced plans to take the matter to the State DGP soon and warned that the Nadigadda Rights Struggle Committee would intensify its protests across the district if justice is not served for Rajeswari's family. Kumar also called on the government to support the bereaved family.\n\nSeveral committee members and leaders participated in the event, including District Convenor Bucchibabu, District Secretary Lavanna, poet Avani shree, leaders\n\nRangaswami and Venkataramulu, Gadwal Mandal leaders Gouni Srinivas Yadav, Karthik, Maldakal Mandal President B. Vishnu, Prem Raj, Gattu Mandal President Balaram Naidu, Dharur Mandal Vice President Adivi Anjaneyulu, K.T. Doddi Mandal leaders Vijay Gajendra, Lakshmanna, Samiyeal, Swamy, Maldakal, and Jammanna.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/10/29/1493123-gadw.jpg",
        "link": "https://www.thehansindia.com/telangana/justice-demanded-for-minor-girls-death-nadigadda-rights-struggle-committee-leads-rally-in-gadwal-917958"
    },
    {
        "title": "Timmar Mallanna to Address Concerns Over Minor Girl's Death in Gadwal.",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-10-28",
        "text": "Gadwal : Timmar Mallanna, the Member of Legislative Council (MLC), has expressed serious concern over the recent death of a minor girl from the BC community, Rajeshwari, belonging to the Vaddera social group, in the Mallakhal mandal of Jogulamba Gadwal district. Timmar Mallanna is scheduled to visit the girl’s family on October 30th to offer condolences.\n\nOn Monday, Timmar Mallanna's team, including state committee member M. Shiva Veer, visited Rajeshwari's native village, Bijwaram, along with Praveen Raj, the president of the Timmar Mallanna team in Gadwal district. They met with Rajeshwari's mother to express their condolences. Congress party constituency in-charge Sarita Tirupathiah also visited the family. During their visit, they demanded the arrest and strict punishment of Bandla Rajasekhar Reddy, a worker linked to the incident leading to Rajeshwari’s death. They further demanded the provision of a double bedroom house and an ex-gratia payment of 50 lakhs to the family.\n\nMembers of the Timmar Mallanna team from Narayanpet district, including Venkata Reddy and Vijay Kumar Goud, and co-convenor of the Jogulamba Gadwal district team, Neela Narsinglu, along with Maladkal mandal convenor Thirumala, and other leaders from the Akhilapaksham, also participated in the visit.\n\nA significant tribute was paid in Maladkal mandal under the leadership of the Nadigadda Rights Struggle Committee, demanding legal action against Bandla Rajasekhar Reddy for the death of Rajeshwari. The committee called for immediate action and the arrest of the accused in connection with her death.\n\nThis call was echoed in several villages including Salakapura, Aluru, and Nagar Doddipalli, where locals gathered to pay their respects and demanded justice for Rajeshwari. The Nadigadda Rights Struggle Committee organized these tributes, emphasizing the need for legal measures against Bandla Rajasekhar Reddy for his alleged role in the tragic incident.\n\nThe situation has drawn significant attention, and local leaders are urging swift action to address the concerns surrounding the circumstances of Rajeshwari’s death.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/10/28/1492827-untitled-1.jpg",
        "link": "https://www.thehansindia.com/telangana/timmar-mallanna-to-address-concerns-over-minor-girls-death-in-gadwal-917711"
    },
    {
        "title": "Farmers protest in Gadwal over delayed Rythu Bharosa payments",
        "author": [
            "Newstap Bureau"
        ],
        "publish_date": "2024-10-25",
        "text": "GADWAL: Farmers in Jogulamba Gadwal district, led by Nadigadda Hakkula Porata Samithi Chairman Gongala Ranjith Kumar, protested outside the Collector's office on Friday, expressing frustration over the Congress government's failure to deposit Rythu Bharosa funds as promised before the Dussehra festival.\n\nRanjith Kumar, joined by around 200 farmers, criticised the delay, calling it \"unacceptable.\"\n\nRanjith Kumar stated that the government's commitment to provide Rs 2 lakh loan waivers for farmers has so far remained unfulfilled. He further accused the authorities of ignoring farmers' grievances, alleging that the district Collector and police had dismissed requests to discuss these pressing issues.\n\nThe protestors also criticised what they see as a lack of empathy from officials, contrasting the current handling of farmer grievances with a recent incident in Bijwaram village, where police facilitated a young girl's funeral with heavy security. Farmers expressed anger at being barred from discussing their issues at the Collector's office, claiming this reflects poorly on the Congress administration’s approach to governance.\n\nThe protesters demanded an immediate resolution to the pending Rythu Bharosa disbursements, urging the government to address farmers' financial needs without further delay.",
        "top_image": "https://www.newstap.in/h-upload/2024/10/25/1662696-farmers-protest-in-gadwal.webp",
        "link": "https://www.newstap.in/telangana/farmers-protest-in-gadwal-over-delayed-rythu-bharosa-payments-1556020"
    },
    {
        "title": "HC prods officials to probe major scam",
        "author": [
            "The Hans India"
        ],
        "publish_date": "2024-10-24",
        "text": "Gadwal: Acase has been registered following the orders of the High Court in connection with a double claim scam related to the land acquisition of the Nettempadu Lift Irrigation Scheme. The scam, amounting to crores of rupees, took place between 2016 and 2018.\n\nGadwal Court Superintendent Satyanarayana allegedly made nine fraudulent entries under his wife Lalitha’s name and illegally transferred money into accounts.\n\nWith the case now registered, it is expected that more names from within the Gadwal court might emerge in connection with this scandal. Since the fraud occurred within the judicial department, it had previously gone unnoticed.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/10/24/1491716-scam.jpg",
        "link": "https://www.thehansindia.com/telangana/hc-prods-officials-to-probe-major-scam-916658"
    },
    {
        "title": "Jogulamba Gadwal Police Conducts Open House to Raise Awareness Among Students on Policing and Public Safety",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-10-24",
        "text": "Gadwal: \"Students should not only focus on academics but also increase awareness about society and the services provided by the police\" - District SP Mr. T. Srinivasa Rao, IPS\n\nAs part of Police Martyrs’ Remembrance (Police Flag Day), the District SP, Mr. T. Srinivasa Rao, IPS, participated in the final day of the Open House event organized at the Police Parade Ground, aimed at raising awareness among students.\n\nAddressing the students who visited the Open House stalls, the District SP emphasized the importance of students being active in academics and being aware of the developments in society as well as the services provided by the police department. Around 600 students from SR International School and Social Welfare Schools visited the stalls on the third and final day of the Open House.\n\nSpeaking on the occasion, the SP stated that the three-day Open House program was organized to make students aware of the police department's operations and the various services it offers to the public. He stressed the need for students to understand what a police station is, its role in maintaining law and order, and how it functions. For this purpose, stalls featuring SHE Teams, Cyber Security Wing, Communication, Anti-Drug Unit, Arms Exhibition, Dog Squad, and Bomb Disposal were set up to educate the students.\n\nThe SP also advised the students to focus on their future goals, study diligently, and use mobile phones only when necessary. He warned against opening suspicious links or sharing photos online, as this could lead to photo morphing and cybercrimes.\n\nKey Topics Covered During the Event:\n\nThe concept of Friendly Policing and how beat and patrolling systems work day and night to maintain public safety and order.\n\nThe introduction of modern technology like face recognition systems and portable fingerprint devices to easily identify criminals.\n\nThe role of CCTV cameras in preventing crimes and solving cases swiftly.\n\nHow SHE Teams and Bharosa Centers work to protect women and girls.\n\nDemonstrations of police weaponry, how they function, and when they are used.\n\nThe role of bomb squads in defusing explosives.\n\nPrecautions against Cyber Crimes, such as avoiding contact with strangers online and immediately reporting incidents to the Cyber Crime helpline number, 1930.\n\nHow dogs help in identifying criminals, thieves, and explosives.\n\nOfficers from various police departments, including the bomb squad, IT Core, Bharosa staff, SHE Teams, Fingerprints, and Communication teams, educated the students about the operations of the police department.\n\nThe event was attended by Armed Forces DSP Narendra Rao, RI Venkatesh, Harif, and RSI officers, along with 600 students and teachers from SR School and Social Welfare School.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/10/24/1491842-police.jpg",
        "link": "https://www.thehansindia.com/telangana/jogulamba-gadwal-police-conducts-open-house-to-raise-awareness-among-students-on-policing-and-public-safety-916778"
    },
    {
        "title": "Gadwal: Farmers protest for relief in Aija",
        "author": [
            "The Hans India"
        ],
        "publish_date": "2024-10-21",
        "text": "Gadwal: In response to a call given BRS working president KTR, farmers in Aija tried to burn an effigy of Chief Minister A Revanth Reddy. However, the bid was foiled at the petrol station junction in Aija.\n\nLeading the BRS protest, G Chinna Devanna, the municipal chairman, accused the Revanth Reddy government of going back on electoral promises and leaving farmers in the lurch. He demanded immediate release of Rythu Bharosa aid. Councilors Hussein, Venkatesh, Anjaneyulu, and others including former Sarpanch Mahesh, took part in the protest.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/10/21/1490763-farmers.jpg",
        "link": "https://www.thehansindia.com/telangana/gadwal-farmers-protest-for-relief-in-aija-915864"
    },
    {
        "title": "CM Cup 2024 Torch Rally Flagged Off in Gadwal: Aiming to Nurture Athletes from Village to International Level",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-10-19",
        "text": "Gadwal: District Collector B.M. Santosh said that students and youth should excel in sports from the rural level to the international level. On Saturday, District Collector B.M. Santosh, along with SP Thota Srinivasa Rao and Gadwal MLA Krishna Mohan Reddy, lit the torch for the \"CM Cup 2024\" at Sangala Park and flagged off a rally. The torch rally, attended by a large number of youth, proceeded from Sangala Park to the Gadwal Collectorate.\n\nSpeaking on the occasion, the District Collector mentioned that the torch rally was organized across the state to raise awareness about the CM Cup 2024, with the goal of nurturing athletes from the village level to the world stage. He emphasized the need to identify talent at the village level to ensure athletes from Telangana can participate in competitions like the Olympics. Through the CM Cup program, athletes with good skills from the village, mandal, and district levels will be selected and encouraged to compete at the state, national, and international levels, including the Olympics. The government, in addition to providing special incentives, will also offer government jobs to those who excel in sports. He highlighted the state's recent appointments of athletes like Nikhat Zareen, who participated in the Olympics, and Mohammad Siraj, a T20 World Cup cricket winner, to DSP-level positions. He also noted that sports have evolved from being just games to becoming professional careers. While mental health is important, physical health is equally crucial, and sports play a vital role in personal development. He added that through sports, individuals not only improve physical fitness but also become mentally stronger.\n\nSP Srinivasa Rao remarked that sports improve both physical health and mental strength. He added that individuals excelling in sports have better opportunities to join the police force, as it requires a combination of physical and mental strength to overcome the challenges in the field. He mentioned that the government is fully committed to promoting young athletes selected from the village level through the CM Cup, giving them opportunities to excel at the state and national levels.\n\nGadwal MLA Krishna Mohan Reddy highlighted that the main objective of the CM Cup 2024 is to identify and encourage talented athletes from villages, mandals, and districts. He assured that every athlete at the mandal, village, and district levels would receive appropriate opportunities. He also expressed his hope that athletes from Gadwal will be selected for state-level competitions, and further, that athletes from the region will participate in the Olympics representing Telangana.\n\nAdditional Collector Lakshmi Narayana, Battalion DSP Raghunath Chauhan, District Sports Officer B.S. Anand, officials, and athletes were present at the event.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/10/19/1490459-cm.jpg",
        "link": "https://www.thehansindia.com/telangana/cm-cup-2024-torch-rally-flagged-off-in-gadwal-aiming-to-nurture-athletes-from-village-to-international-level-915619"
    },
    {
        "title": "Neeli Srinivasulu Valmiki Sworn in as Jogulamba Gadwal District Library Chairman Amid Grand Celebrations",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-10-18",
        "text": "Gadwal : A massive rally was held from the District Collectorate to Krishnaveni Junction in Jogulamba Gadwal District to celebrate the swearing-in ceremony of Neeli Srinivasulu Valmiki as the Chairman of the District Library. Thousands of Congress workers enthusiastically participated in the rally.\n\nAt Krishnaveni Junction, Minister Ponnam Prabhakar and AICC Secretary Sampath Kumar unveiled a statue of Sardar Sarvai Papanna Goud. The swearing-in ceremony for Neeli Srinivasulu Valmiki as the Library Chairman was conducted by Dr. Riaz, State Library Chairman, in a grand event held at Krishnaveni Junction.\n\nFollowing the ceremony, Minister Ponnam Prabhakar congratulated Neeli Srinivasulu Valmiki on his appointment. The event was attended by prominent leaders, including Gadwal Congress in-charge Saritha Tirupathayya Yadav, Municipal Chairman B.S. Keshav, Mahbubnagar Municipal Chairman Anand Goud, and other key figures.\n\nMinister Ponnam Prabhakar's Address:\n\nMinister Ponnam Prabhakar extended heartfelt congratulations to Neeli Srinivasulu Valmiki on assuming office as the Library Chairman of Gadwal. He also spoke about the significance of unveiling the statue of Sarvai Papanna Goud, a leader who united people and fought for sovereignty.\n\nMinister Prabhakar emphasized the inspiration that comes from figures like Jyoti Rao Phule and Dr. B.R. Ambedkar, whose lives continue to guide future generations. He highlighted the need for libraries to be utilized by students preparing for competitive exams, expressing the hope that Gadwal would become the leading district in the state in securing jobs.\n\nHe also shared the success story of a Dalit becoming the Library Chairman in Siddipet and expressed pride that a Valmiki community leader is now serving as the Chairman in Gadwal.\n\nMinister Prabhakar praised the efforts of the Telangana state government under the leadership of the Honorable Chief Minister in propelling the united Mahbubnagar district towards progress. He mentioned several welfare schemes introduced over the past ten months, such as free travel for women in RTC buses, subsidized cooking gas, free electricity for up to 200 units, and a health insurance scheme covering up to 10 lakh rupees.\n\nAdditionally, the government has sanctioned 3,500 Indiramma houses and implemented a 2 lakh rupees loan waiver for farmers. For loans exceeding this amount, the government is offering partial waivers as well.\n\nMinister Prabhakar also addressed the opposition's criticism, urging Congress workers to be prepared to counter negative narratives. He reaffirmed that the government is committed to justice for the SC, ST, BC, and minority communities, as promised by Rahul Gandhi, through the introduction of caste-based census and fair reservation policies.\n\nHe concluded by encouraging party members to remain steadfast, stating that the government will work in alignment with their aspirations. Despite the Congress party not being in power for some time, he reflected on his own experience, having stood firm as an NSUI activist and urged others to carry the party's flag forward.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/10/18/1490086-whatsapp-image-2024-10-18-at-44619-pm-1.jpg",
        "link": "https://www.thehansindia.com/telangana/neeli-srinivasulu-valmiki-sworn-in-as-jogulamba-gadwal-district-library-chairman-amid-grand-celebrations-915343"
    },
    {
        "title": "BRSV Jogulamba Gadwal District Coordinator Kurava Pallayya Meets BRS Working President K.T. Ramanna, Discusses Key Student Initiatives",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-10-17",
        "text": "In a meeting with BRS representatives at Telangana Bhavan, BRS party Working President K.T. Ramanna met with Kurava Pallayya, the BRSV (Bharat Rashtra Samithi Vidyarthi) Jogulamba Gadwal District Coordinator.\n\n\n\nDuring this occasion, K.T. Ramanna instructed Pallayya to establish BRSV committees in every college across the Jogulamba Gadwal district. He emphasized the need to expose the Congress government's negligent attitude towards the education system. He urged for a strong fight to ensure that scholarships and fee reimbursements promised by the Congress government are provided to students. Additionally, he called for action to pressurize the government into addressing infrastructure deficiencies in Gurukul schools and ensuring timely rent payments for rented buildings.\n\nRamanna also highlighted the importance of continuous efforts to empower students in the district and assured that student leaders working for the party would be given due recognition in the future.\n\nOn this occasion, Kurava Pallayya introduced the district BRSV student leaders, including Bharat, Maj, Chinna, Rehman, Raju, Ashok, and other team members, to State President Gellu Srinivas Yadav at Telangana Bhavan.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/10/17/1489877-brsv.jpg",
        "link": "https://www.thehansindia.com/telangana/brsv-jogulamba-gadwal-district-coordinator-kurava-pallayya-meets-brs-working-president-kt-ramanna-discusses-key-student-initiatives-915135"
    },
    {
        "title": "Congress leader’s son dies in road accident in Jogulamba Gadwal district",
        "author": [
            "Newstap Bureau"
        ],
        "publish_date": "2024-10-16",
        "text": "GADWAL: A tragic road accident claimed the life of Patel Ramachandra Reddy (28), the son of former ZPTC member and ex-Congress DCC president Patel Aruna Prabhakar Reddy, in Jogulamba Gadwal district.\n\nThe accident occurred near Dyyala Vagu, where his car crashed into a culvert.\n\nLocal residents noticed the crash and rushed Ramachandra Reddy to the hospital, but he succumbed to his injuries en route. The incident has left his family in deep grief, and further details about the accident are awaited.\n\nInvestigations are underway to determine the cause of the accident.",
        "top_image": "https://www.newstap.in/h-upload/2024/10/16/1660455-congress-leaders-son-dies-in-road-accident.webp",
        "link": "https://www.newstap.in/crime/congress-leaders-son-dies-in-road-accident-in-jogulamba-gadwal-district-1554859"
    },
    {
        "title": "Bathukamma Event: Hyderabad Mayor Gadwal Vijayalaxmi booked for allowing high-decibel music",
        "author": [
            "Authors"
        ],
        "publish_date": "2024-10-14",
        "text": "The Hyderabad Mayor, Gadwal Vijayalaxmi, is facing legal scrutiny after allegations surfaced of her organising and using a loud music system at a Bathukamma event last week in Banjara Hills. Police said that the Mayor allegedly interfered when the police reached the place on Road Number 12 and asked the sound system organisers to reduce the volume.\n\nThe incident took place in NBT Nagar, where the event organisers were reportedly violating a citywide ban on DJ systems during religious processions and festivals. Police arrived at the venue around 11:30 p.m. on Thursday and instructed the organisers to shut down the equipment. However, the organisers allegedly refused to comply when the Mayor interfered with the police.\n\n“A case has been registered for violating noise pollution regulations against the organisers and the sound system operator. Mayor Gadwal Vijayalakaxmi was booked for abetment,” clarified a senior officer from West Zone police.",
        "top_image": "https://th-i.thgim.com/public/todays-paper/tp-national/tp-telangana/u9c08s/article64993547.ece/alternates/LANDSCAPE_1200/Non-allocation-GOU9F1CKV3jpgjpg",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/hyderabad-mayor-booked-for-allowing-high-decibel-music-at-bathukamma-event/article68750145.ece"
    },
    {
        "title": "Mayor booked for allowing music beyond permitted hours in Telangana",
        "author": [
            "Express News Service"
        ],
        "publish_date": "2024-10-14",
        "text": "HYDERABAD: Banjara Hills police have registered a case against Hyderabad Mayor Gadwal Vijayalaxmi and others for allegedly permitting loud music beyond the allowed hours during a Bathukamma event on Thursday. The event took place at NBT Nagar in Banjara Hills, where organisers reportedly played music well past the permitted time.\n\nThe police have registered a case under Sections 223, 280 and 292 of the Bharatiya Nagarik Suraksha Sanhita (BNSS) for disobeying orders issued by public servants, creating a noxious atmosphere harmful to health and causing public nuisance.\n\nA video of the event, widely circulated on social media, shows the mayor standing on a dais, holding a sword, and urging women to wield swords as well. The video drew significant backlash online.\n\nIn response to the criticism, the mayor took to X (formerly Twitter) and addressed the incident, stating, “There was an issue concerning women in the area. I assured the women that no one could take advantage of them and that I had been addressing their concerns. I believe there is nothing wrong in standing by them when they need me.”",
        "top_image": "https://media.assettype.com/newindianexpress%2F2024-07%2F1e84a8f2-693c-41ae-8eb3-e0663c3245fa%2FChao.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
        "link": "https://www.newindianexpress.com/states/telangana/2024/Oct/14/mayor-booked-for-allowing-music-beyond-permitted-hours-in-telangana"
    },
    {
        "title": "Bathukamma: Hyderabad Mayor Gadwal Vijayalakshmi booked for causing noise pollution, disturbance",
        "author": [
            "Newsmeter Network"
        ],
        "publish_date": "2024-10-14",
        "text": "Hyderabad: Police have registered a case against Hyderabad Mayor Gadwal Vijayalakshmi for violating the permission clause for the Bathukamma event and causing disturbance by playing loud music at NBT Nagar in Banjara Hills.\n\nAccording to the Banjara Hills police, the incident occurred on October 10 during the Bathukamma festival. Mayor Vijayalakshmi was the chief guest at the event.\n\nPolice officers patrolling the area arrived at the event around 11:30 PM, as the permission was only valid until 10:00 PM.\n\nA police constable reportedly requested the event organizers to stop the music due to concerns over noise pollution. However, Mayor Gadwal Vijayalakshmi allegedly approached the constable, insisting that the police should not interfere and allow the event to continue with high-decibel music.\n\nDespite the police's intervention, efforts were made to continue the event, leading to a significant disturbance in the neighborhood.\n\nAs a result, the Banjara Hills police registered a case against the event organizers, Kandadi Vijay Kumar and Mohd Ghouse, as well as Mayor Gadwal Vijayalakshmi. They have been booked for violating noise pollution regulations under section 223, 280, 292, 49 r/w 3(5) BNS, and Sec 21/76 of the CP Act.",
        "top_image": "https://newsmeter.in/h-upload/2024/10/14/384447-img-20241013-wa0041.webp",
        "link": "https://newsmeter.in/hyderabad/bathukamma-hyderabad-mayor-gadwal-vijayalakshmi-booked-for-causing-noise-pollution-disturbance-737346"
    },
    {
        "title": "Hyderabad Mayor Vijayalakshmi Booked for Noise Pollution Violations",
        "author": [
            "Dc Correspondent",
            "About The Author"
        ],
        "publish_date": "2024-10-14",
        "text": "Hyderabad:The Banjara Hills police on Sunday booked a suo motu case against Hyderabad mayor Gadwal Vijayalakshmi for violating noise pollution norms during the Bathukamma celebrations on October 10.\n\nAccording to the police, the mayor was present at the Bathukamma celebrations at NBT Nagar where DJs played loud music beyond permitted hours. Locals complained to the police about the noise pollution during late hours.\n\n\n\nSpeaking at the event, Vijayalakshmi said that some jealous people did not like the Bathukamma celebrations and had informed the police.\n\n\n\nA video of the Mayor at the same event went viral, showing her wielding a sword and assuring the people of NBT Nagar of Banjara Hills, from where she is a corporators, need not worry and people who resort to atrocities against women would not be spared.\n\n22-Year-Old Band Master Found Dead in Jagathgirigutta\n\nHyderabad:The body of a 22-year-old band master was found in an isolated place in Teen Bandhu Colony at about 3 am on Sunday, Jagathgirigutta police said. The victim Mohammed Nadeem Pasha had left his house at 2 pm on Saturday.\n\n\n\nPolice suspect that one Khaleel along with his associates might have hit the victim. A special team is trying to arrest the accused.\n\nMan Murders Wife After Dispute Over Attire in Saroornagar\n\nHyderabad:A man murdered his wife reportedly when she asked him to wear a kurta pyjama on Sunday afternoon, Saroornagar police said. The deceased has been identified as Soni, 32, and the accused as Venkatesh, 37.\n\n\n\nSaroornagar investigating officer Mahender said Soni was a victim of domestic violence and Venkatesh would beat her up on at home.\n\n\n\n\"His wife cajoled him a bit to wear a Punjabi dress and so he was angry. This sparked a quarrel and Venkatesh stabbed her. There are eight stab injuries in different parts of Soni’s body,\" Mahender said.\n\n\n\nVenkatesh has reportedly been taken into police custody. He reportedly suffered an injury on his hand during the assault on Soni. Police said they were investigating the case.\n\n",
        "top_image": "https://www.deccanchronicle.com/h-upload/2024/10/13/1851680-vijaya-lakshmi.jpg",
        "link": "https://www.deccanchronicle.com/news/crime/hyderabad-mayor-vijayalakshmi-booked-for-noise-pollution-violations-1829975"
    },
    {
        "title": "Video: Hyderabad Mayor draws ire over sword display at Bathukamma event",
        "author": [
            "News Desk"
        ],
        "publish_date": "2024-10-11",
        "text": "Hyderabad: Hyderabad Mayor Vijaylaxmi Gadwal raked in controversy after brandishing a sword at Bathukamma celebrations at NBT Nagar Banjara Hills on Thursday, October 10.\n\nThe Mayor uploaded the video on her social media accounts where women dressed in traditional attire are seen dancing to music played on a DJ system at high volume.\n\nIn the videos, the Hyderabad Mayor who is standing atop a dais, is seen brandishing a sword. “No one should put evil eye on women and girls in NBT Nagar. Today I am wielding a sword, tomorrow you all girls should hold the sword,” said Gadwal, drawing cheers from the crowd.\n\nAlso Read Hyderabad police ban DJs, firecrackers during religious processions\n\n“We are celebrating Bathukamma here, and some jealous people are calling the police on us,” added Gadwal. The Hyderabad Mayor made these statements after some local residents complained to the police about the DJ playing music too loudly at the venue.\n\nIt is pertinent to note that the Hyderabad police have banned the use of firecrackers and DJs for music during religious processions and events, citing noise pollution and the safety of residents.\n\nThe decision was made after observing an alarming increase in the use of DJ sound systems and firecrackers during these processions. The use of DJ systems during religious processions also increases the chances of uncontrolled behaviour by participants, potentially leading to law and order issues, the police had stated.\n\nAdditionally, the use of firecrackers in procession routes in Hyderabad crowded with hundreds or thousands of people poses a significant danger.\n\nAlso Read Hyderabad Mayor, Corporators meet Yogi during study tour in Lucknow\n\nAlthough DJs are banned during religious processions in Hyderabad, sound systems are permitted, but with restrictions on sound decibel limits.",
        "top_image": "https://cdn.siasat.com/wp-content/uploads/2024/10/Hyderabad-Mayor-sword-bathukamma.jpg",
        "link": "https://www.siasat.com/video-hyderabad-mayor-draws-ire-over-sword-display-at-bathukamma-event-3110955/"
    },
    {
        "title": "Jogulamba Gadwal District Must Lead in Every Health Program: DMHO Dr. Siddappa",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-10-04",
        "text": "Gadwal: Today, a review meeting was held at the Jogulamba Gadwal District Medical and Health Department office, led by District Medical and Health Officer (DMHO) Dr. Siddappa. Addressing various Primary Health Center (PHC) supervisors, Dr. Siddappa emphasized the importance of each PHC being at the forefront of all health programs in the district.\n\n\n\nHe highlighted the crucial role of supervisors in these initiatives, urging them to be aware of targets and achievements in advance, and to work closely with their staff. He recommended holding a \"part night\" meeting every 15 days to review progress and stressed the need to increase the number of deliveries in government hospitals while reducing private deliveries.\n\nThe review meeting was attended by District Program Officers Dr. Sandhya Kiran Mai, Dr. Naveen Kumar Reddy, Dr. G. Raju, and Dr. Prasoonarani, along with district medical staff including DDM Ramu, ASO Tirumalesh Reddy, District NCD Coordinator Shyamsunder, and various PHC supervisors.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/10/04/1486369-whatsapp-image-2024-10-04-at-72915-pm.jpg",
        "link": "https://www.thehansindia.com/telangana/jogulamba-gadwal-district-must-lead-in-every-health-program-dmho-dr-siddappa-912121"
    },
    {
        "title": "Six-year-old boy severely injured in stray dog attack in Gadwal",
        "author": [
            "Newstap Bureau"
        ],
        "publish_date": "2024-10-04",
        "text": "GADWAL: A six-year-old boy suffered severe injuries following a stray dog attack in Amaravai village, Manavapadu mandal, Jogulamba Gadwal district.\n\nThe incident occurred when the body, Revanth, was playing near his home and was suddenly attacked by a stray dog.\n\nLocal residents responded quickly, managing to rescue the boy from the dog. Revant sustained multiple injuries in the attack and was immediately rushed to the Kurnool Government Hospital for urgent medical treatment. Doctors at the hospital reported that his condition, though serious, is stable.\n\nThe incident has sparked concerns among the residents of Amaravai village regarding the rising number of stray dogs in the area. Several villagers have urged local authorities to take measures to prevent similar incidents in the future, highlighting the need for effective control of the stray dog population.",
        "top_image": "https://www.newstap.in/h-upload/2024/10/04/1657923-c5f1d713-acb9-49af-b275-977856ce6195.webp",
        "link": "https://www.newstap.in/crime/a-stray-dog-attacked-a-six-year-old-boy-in-amaravai-village-causing-severe-injuries-1553683"
    },
    {
        "title": "V Lakshminarayana Assumes Charge as Additional Collector (Revenue)",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-09-30",
        "text": "Gadwal: V. Lakshminarayana assumed charge as the Additional Collector (Revenue) of Jogulamba Gadwal district on Monday. He took over his duties in his chamber at the Integrated District Offices Complex. Prior to assuming charge, he met Collector B. M. Santosh at the camp office for a courtesy visit.\n\nPreviously, Lakshminarayana served in the Land Acquisition Department of GHMC, Hyderabad, and was transferred to the district as the Additional Collector. Srinivas Rao, who had been handling full additional responsibilities as Additional Collector, will now continue as the Special Deputy Collector for Land Acquisition.\n\nVarious department officials, including Collectorate AO Veerabhadrappa and office staff, met the new Additional Collector, welcoming him and extending their best wishes.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/09/30/1484944-additional-collector.jpg",
        "link": "https://www.thehansindia.com/telangana/v-lakshminarayana-assumes-charge-as-additional-collector-revenue-910917"
    },
    {
        "title": "Man pours hot oil on hotel owner after dispute over fritters in Gadwal",
        "author": [
            "Newstap Bureau"
        ],
        "publish_date": "2024-09-30",
        "text": "GADWAL: A man threw hot oil on the hotel owner and another bystander, causing severe injuries, following a dispute over fritters in Guvvaladinne village of KT Doddi mandal of Gadwal district.\n\nAccording to Sub-Inspector Srinivas, the accused, Vinod, approached a local hotel run by Bujjanna Goud and demanded fritters. When Bujjanna Goud refused, a heated argument ensued between the two. In anger, Vinod threw hot oil on Bujjanna Goud, which also splashed on Veeresh, who was nearby. Both men suffered injuries from the incident.\n\nFollowing the attack, Veeresh's wife, Shankaramma, filed a police complaint. SI Srinivas confirmed that a case has been registered and that an investigation is underway to address the matter appropriately.",
        "top_image": "https://www.newstap.in/h-upload/2024/09/30/1656929-man-pours-hot-oil-on-hotel-owner.gif",
        "link": "https://www.newstap.in/crime/man-pours-hot-oil-on-hotel-owner-after-dispute-over-fritters-in-gadwal-1553125"
    },
    {
        "title": "President of Dhupa Deepa Naivedya Archaka Sangham, Jogulamba Gadwal District, Comments on Tirumala Laddu Adulteration.",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-09-26",
        "text": "Gadwal : Chakravarti Swamy, President of the Dhupa Deepa Naivedya Archaka Sangham in Jogulamba Gadwal District, recently commented on the adulteration issue involving Tirumala Tirupati Devasthanam (TTD) laddus. He expressed that such an incident could not have occurred without the involvement of the TTD Executive Officer, the temple administration, and even the state's cabinet and endowments department. He emphasized that adulterating laddus is not a minor issue and raised concerns about the influence of the Endowments Department on Hindu temples.\n\n\n\n\n\nSwamy criticized the government for bringing only temples with significant revenue under the control of the Endowments Department, while ignoring thousands of temples with no income. He lamented that many temples are struggling to provide basic offerings like incense, lamps, and food offerings, and lack proper upkeep and patronage. He questioned why only Hindu temples are being managed under the Endowments Department in a secular country and why churches and mosques are not subjected to the same control.\n\n\n\nSwamy further expressed concern that in rural areas, many temples do not conduct regular rituals, which is leading Hindu youth astray, pushing them toward addictions like alcohol and drugs. He urged parents to teach their children devotion and instill religious values from a young age, suggesting that families should visit temples regularly. He stressed that at least once a week, families should visit a temple to receive blessings, which would not only ensure the well-being and health of their families but also guide children on the right path and contribute to building a better society.\n\nSwamy also announced the launch of the \"Mana Gudi Mana Dharma\" (Our Temple, Our Religion) program in Alampur Mandal, Jogulamba Gadwal District, to raise awareness among Hindu families about their religious duties. Under this initiative, weekly gatherings will be held at different temples, where collective worship, devotional songs, and bhajans will be conducted to promote the revival of Hindu values. He called on every Hindu citizen, at the village, state, and national levels, to take responsibility for spreading and protecting Sanatana Dharma.\n\n\n\nPulikal Veeresh and Chagadona Satish, among others, participated in the program.\n\n",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/09/26/1483822-tirumala-laddu.jpg",
        "link": "https://www.thehansindia.com/telangana/president-of-dhupa-deepa-naivedya-archaka-sangham-jogulamba-gadwal-district-comments-on-tirumala-laddu-adulteration-909940"
    },
    {
        "title": "BRSV Jogulamba Gadwal District Coordinator Kurva Pallayya Extends Congratulations to New Alampur Mandal MEO Ramulu Dayal",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-09-26",
        "text": "Gadwal: At the MRC building in the Alampur constituency’s Ieeja Mandal, BRSV Jogulamba Gadwal District Coordinator, Kurva Pallayya, honored newly appointed Mandal Education Officer (MEO), Ramulu Dayal, by presenting him with a shawl and extending his best wishes.\n\nOn this occasion, District Coordinator Kurva Pallayya stated:\n\nHe urged the MEO to focus on providing basic amenities and quality education in both private and government schools in Ieeja Mandal. He suggested that private schools be inspected twice a month to ensure the availability of essential facilities, such as toilets, bathrooms, and proper student supervision, to maintain high educational standards.\n\nHe also emphasized the importance of ensuring that private school buses are equipped with CCTV cameras, cleaners, GPS tracking, and fitness certifications. In light of recent school bus accidents, Pallayya stressed the need for strict measures to prevent such incidents.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/09/26/1483942-brsv.jpg",
        "link": "https://www.thehansindia.com/telangana/brsv-jogulamba-gadwal-district-coordinator-kurva-pallayya-extends-congratulations-to-new-alampur-mandal-meo-ramulu-dayal-910044"
    },
    {
        "title": "SP condoles death of woman cop",
        "author": [
            "The Hans India"
        ],
        "publish_date": "2024-09-19",
        "text": "Gadwal: Jogulamba Gadwal District SP T Srinivas Rao expressed deep condolences over the tragic death of Kumari Sravani (WPC-230), a woman constable serving at KT Doddi Police Station, who passed away in a road accident near Nagarjuna Sagar on Wednesday.\n\nSravani was diligently performing her reception duties at the police station, Rao noted and expressed his condolences to the bereaved family. He said her death was a great loss the district police force.\n\nHe assured the bereaved family that the police department would stand by them and provide all support and assistance to them in this difficult time.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/09/19/1481691-sp.jpg",
        "link": "https://www.thehansindia.com/telangana/sp-condoles-death-of-woman-cop-908086"
    },
    {
        "title": "BRS Leaders Arrested in Gadwal district, in Protest Against Attack on MLA Kaushik Reddy's Residence",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-09-13",
        "text": "Gadwal: BRS Leaders Arrested Near Gadwal in Protest Against Attack on MLA Kaushik Reddy's Residence\n\n\n\nSeveral BRS leaders, including Nagar Doddi Venkata Ramulu, Rangu Maddileti, were taken in to custody and sent to Ieeja police station.And TRS student union leader Kuravapallya, was arrested near Mellacheruvu in Gadwal while he was heading to Hyderabad in response to a call by former Minister Harish Rao to protest against the attack on MLA Kaushik Reddy's residence. The leaders were arrested by local police and taken to the town police station.\n\nAdditionally, former TRS market yard chairman Patel Vishnuvardhan Reddy was arrested late at night and shifted to the Aija police station, while BRS leader Boss Hanumanthu Naidu was placed under house arrest.\n\nSpeaking on the arrests, BRS leader Nagar Doddi Venkata Ramulu criticized the actions of the police, accusing the Revanth Reddy government of turning the administration into a police state. He remarked that under the current Congress government, arrests have become routine, especially targeting opposition leaders, students, and activists. He condemned the actions as an attempt to suppress dissent and stifle a strong opposition, which he argued is essential for the welfare of the people.\n\nRamulu further accused the ruling party of orchestrating the attack on MLA Kaushik Reddy after he held a press meet criticizing defections. He claimed the attack, allegedly carried out by MLA Arikepudi Gandhi, was a direct response to Reddy’s statements. Ramulu urged the Congress government to focus on solving public issues rather than suppressing opposition voices.\n\nHe also condemned the preemptive arrests in Gadwal constituency, stating that such actions were an attack on democratic rights. Ramulu warned that if Chief Minister Revanth Reddy’s government continues with these methods, the people will rise and teach the Congress party a lesson.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/09/13/1479951-brs.jpg",
        "link": "https://www.thehansindia.com/telangana/brs-leaders-arrested-in-gadwal-district-in-protest-against-attack-on-mla-kaushik-reddys-residence-906719"
    },
    {
        "title": "GHMC Mayor seeks ₹10,500 crore from 16th Finance Commission",
        "author": [
            "Authors"
        ],
        "publish_date": "2024-09-10",
        "text": "Greater Hyderabad Municipal Corporation (GHMC) mayor Gadwal Vijayalakshmi has made a pitch for allocation of ₹10,500 crore for development of Hyderabad, to the 16th Finance Commission which is currently on a tour of the city and Telangana.\n\nShe has submitted a representation to the chairman of the commission Arvind Panagariya on Monday (September 9, 2024), during the meeting with political party representatives.\n\nFor the period of the 16th Finance Commission’s recommendations, which would start from April 1, 2026, the Mayor sought ₹7,500 crore for providing ‘world class’ infrastructure in the city which comprises road upgradation, comprehensive maintenance of roads, strengthening of stormwater drains, addressing traffic issues and reduction of air pollution, besides mitigation of urban flooding.\n\nAllocation of ₹1,500 crore was requested for bioremediation and biomining of the legacy dump sites and ground and surface water remediation at the legacy dump sites. Besides, ₹800 crore was sought for preservation of lakes, and management of urban flooding in the city, and ₹250 crore each for GIS mapping of the city for execution of Master Plan and for AI-based traffic management system. Allocation of ₹200 crore was for preservation of heritage structures.\n\nThe Greater Hyderabad Municipal Corporation has spent about ₹18,000 crore as capital expenditure (₹6,000 crore as loans) during the past 10 years, and will need same amount of funds for the coming five years, as per the representation.\n\nThough the nature and scope of services to be provided by the GHMC are very broad, the 15th Finance Commission had recommended grant only for two components, namely Solid Waste Management and National Clean Air Programme, as per the letter.",
        "top_image": "https://th-i.thgim.com/public/news/cities/Hyderabad/aomty/article68625109.ece/alternates/LANDSCAPE_1200/GHMC%20Mayor%20at%2016th%20Finance%20Commission.jpg",
        "link": "https://www.thehindu.com/news/cities/Hyderabad/ghmc-mayor-seeks-10500-crore-from-16th-finance-commission/article68622944.ece"
    },
    {
        "title": "Teachers’ Day Celebrations Held in Jogulamba Gadwal District",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-09-05",
        "text": "Gadwal: The role of teachers in shaping the future and development of students is crucial, said District Collector B.M. Santosh during the Teachers' Day celebrations held at the Ananta Functional Hall in the district headquarters on Thursday. The event, organized to honor the birth anniversary of Dr. Sarvepalli Radhakrishnan, saw the felicitation of the district's best teachers.\n\nCollector B.M. Santosh and Gadwal MLA Bandla Krishnamohan Reddy attended the event as chief guests. The program began with the lighting of the ceremonial lamp. Speaking on the occasion, the District Collector emphasized that teachers play a pivotal role in a student's personality development and future success. He extended special thanks to the teachers of the Gadwal region for their dedicated service. The Collector also highlighted the importance of using modern technology in education and urged every teacher to adopt and mentor at least five students, helping them excel in their studies.\n\nHe further noted that a teacher's behavior significantly influences a student's character, and therefore, teachers should not only focus on academics but also encourage physical education. The Collector also announced funds under the Special Development Fund, with ₹60 lakhs allocated to the Government Girls High School, ₹75 lakhs to the Government Girls Junior College, ₹50 lakhs to ZPHS Revalapalli, and ₹30 lakhs to MPPS Bureddipalli.\n\nGadwal MLA Bandla Krishnamohan Reddy, in his address, stressed the importance of teachers in every field, stating that success in any area requires the support and guidance of teachers. He added that while a mother gives birth to a child, a teacher helps shape their future, and urged the teachers of the district to continue bringing honor to the region through their efforts.\n\nA total of 53 teachers were recognized as the best in the district, with the District Collector, Gadwal MLA, and Additional Collector presenting them with certificates of appreciation, mementos, shawls, and garlands.\n\nThe event was attended by Additional Collector Narsinga Rao, Market Yard Chairman Hanumanthu, headmasters, teachers, and students",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/09/05/1477527-teachers.jpg",
        "link": "https://www.thehansindia.com/telangana/teachers-day-celebrations-held-in-jogulamba-gadwal-district-904738"
    },
    {
        "title": "Differences in Gadwal Congress to the fore over Market Yard Committee chairman post",
        "author": [
            "Telangana Today"
        ],
        "publish_date": "2024-08-30",
        "text": "Differences in Gadwal Congress to the fore over Market Yard Committee chairman post\n\nEver since BRS MLA B Krishnamohan Reddy defected to Congress, party incharge Saritha Tirupataiah has been locking horns with the former over different issues\n\nBy Telangana Today Published Date - 30 August 2024, 11:16 AM\n\nJogulamba Gadwal: Internal rumblings continue to surface in the district Congress unit. Ever since BRS MLA B Krishnamohan Reddy defected to Congress, the party incharge and former Zilla Parishad Chairperson Saritha Tirupataiah has been locking horns with the former over different issues.\n\nThis time, the two groups engaged in a battle over appointment of chairman for Gadwal Market Committee. Both the groups insisting that the person recommended by them should be considered for the appointment. To this effect, both the groups have written letters to the party leadership as well.\n\nAlso Read Gadwal Congress leaders up the ante, oppose defection of BRS MLA\n\nWhile Saritha Tirupataiah recommended the name of Dhanalaxmi for the post, MLA Krishnamohan Reddy referred Kuruva Hanumanthu’s name, according to reports.\n\nThese disturbances in the district unit have been posing challenges for the State leadership. The rivalry between the two groups hit a new high on August 17 when Tourism Minister Jupally Krishna Rao experienced a tough time in convincing both groups.\n\nSaritha’s followers blocked the Minister’s convoy and insisted that he pay a visit to her house before participating in the official programmes.\n\nThis was after the local MLA joined the Minister for participating in the programmes. As the situation turned tense, the Minister heeded to Saritha’s followers demands and left the local MLA disappointed. These are a few instances, which reflect the plight of the BRS MLAs, who had joined the Congress.",
        "top_image": "https://media.telanganatoday.com/wp-content/uploads/2024/08/Telangana-Congress.jpg",
        "link": "https://telanganatoday.com/differences-in-gadwal-congress-to-the-fore-over-market-yard-committee-chairman-post"
    },
    {
        "title": "HYDRA Should Expand Statewide: Kommula Praveen Raj",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-08-28",
        "text": "Gadwal: HYDRA Should Not Only Focus on Lakes but Also Target Encroached Government Lands, Properties, and Illegal Constructions.\n\nKommula Praveen Raj, District President of Teenmaar Mallanna Team in Jogulamba Gadwal.\n\nIn a press conference held today at the Jogulamba Gadwal district headquarters, *Kommula Praveen Raj* expressed his support for the work being carried out by the HYDRA organization in Hyderabad. He praised the efforts and emphasized that HYDRA should not be confined to Hyderabad alone but should be expanded to every village in Telangana state.\n\nPraveen Raj urged Chief Minister Revanth Reddy, who is currently acting as the chairman of HYDRA, to take the initiative to expand HYDRA's operations statewide. He also suggested appointing a capable officer like Ranganath to oversee the organization. The focus should be on reclaiming lakes and government lands that have been illegally occupied, demolishing unauthorized constructions, and ensuring that encroached lands are returned to the rightful owners, particularly the poor.\n\nPraveen Raj called for immediate action against those involved in these illegal activities, including the officials who have supported such encroachments. He demanded that these individuals be removed from their positions and imprisoned to serve as a deterrent to others.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/08/28/1475353-praveen.jpg",
        "link": "https://www.thehansindia.com/telangana/hydra-should-expand-statewide-kommula-praveen-raj-902960"
    },
    {
        "title": "Mayor Gadwal Vijayalakshmi Mandates Facial Recognition Attendance for All GHMC Employees",
        "author": [],
        "publish_date": null,
        "text": "Mayor Gadwal Vijayalakshmi Mandates Facial Recognition Attendance for All GHMC Employees\n\n*Hyderabad, November 6* – Mayor Gadwal Vijayalakshmi has declared that all employees of the Greater Hyderabad Municipal Corporation (GHMC) must register for the facial recognition attendance system, underlining that non-compliance will lead to strict disciplinary action against the respective Heads of Departments (HODs). The announcement came after a surprise inspection at the GHMC headquarters, where the Mayor conducted a thorough review of operations across the Town Planning, Health, and Veterinary Departments.\n\n\n\nDuring the inspection, Mayor Vijayalakshmi met with Additional Commissioners and HODs to stress that the use of the facial recognition system is mandatory for all GHMC staff, including permanent and outsourced employees. She made it clear that any failures in implementing this directive would result in consequences for department heads.\n\n\n\nA significant focus of the inspection was the reporting of outsourced staff. The Mayor questioned the Additional Commissioner about the exact number of outsourced employees at the GHMC headquarters and noted inconsistencies in reporting. To address this, she instructed officials to submit detailed records verifying the authorization of all outsourced hirings by the Commissioner.\n\n\n\nAs part of her directive to strengthen administrative oversight, the Mayor mandated that the attendance system should encompass all employees who are on the GHMC payroll, spanning all departments. Future recruitment processes for outsourced personnel are to be conducted solely at the GHMC head office to ensure centralized management and transparency.\n\n\n\nMayor Vijayalakshmi also highlighted the need for a swift and effective response to public grievances. She instructed officials to resolve citizen complaints promptly and to prevent recurrence of the same issues. If a complaint cannot be resolved, officials must provide the applicant with a written explanation. The Mayor warned that failure to adhere to this directive would result in disciplinary action for the respective department heads.\n\n\n\nThe new measure is aimed at boosting accountability, reducing absenteeism, and ensuring streamlined operations within the GHMC. By implementing facial recognition technology, the GHMC aims to modernize its workforce management and enhance service delivery to the residents of Hyderabad.",
        "top_image": "https://aimamedia.org/fotos/aimanewsphoto1/_newsphoto1448IMG-20241106-WA0058.jpg",
        "link": "https://aimamedia.org/newsdetails.aspx?nid=346825"
    },
    {
        "title": "Telangana DSC 2024 Ranks: Jogulamba Gadwal District Rankers List",
        "author": [],
        "publish_date": null,
        "text": "The DSC exams for a total of 11,062 posts were conducted online from July 18 to August 5.\n\nDownload TS DSC Notification 2023: District-wise SGT, SA Vacancies List https://education.sakshi.com/en/dsc/education-news/ts-dsc-notification-2023-district-wise-sgt-sa-vacancies-list-137995",
        "top_image": "https://education.sakshi.com/sites/default/files/styles/lead_vertical_lead/public/images/2024/10/05/tsdsc244-1728105348.jpg",
        "link": "https://education.sakshi.com/en/dsc/education-news/telangana-dsc-2024-ranks-jogulamba-gadwal-district-rankers-list-164797"
    }
]