[
    {
        "title": "Story Behind Bandla’s Return to BRS",
        "author": [
            "Sridhar Raavi"
        ],
        "publish_date": "2024-07-31",
        "text": "Story Behind Bandla’s Return to BRS\n\nWe are M9 , use this new URL M9.news for latest updates.\n\nGadwal is the second constituency in Telangana where ruling Congress politics backfired after Jagithyal in Operation Akarsh. Saritha Tirupatiah, from the joint Palamuru district, previously served as the chairperson of the Zilla Parishad. She got the ticket for Gadwala MLA after joining the Congress party before the assembly elections against the BRS.\n\nAlso Read – Prashant Kishor’s First Election: Interesting Result\n\nHowever, she was defeated by BRS candidate Bandla Krishna Mohan Reddy in the election. Despite the Congress Party coming to power in the state, her importance has not diminished. Yet, there are those who dislike the ruling party.\n\nThe sitting BRS MLA Bandla Krishnamohan Reddy criticized the Congress. Saritha Tirupatiah appealed to the leadership not to include Bandla in the party under any circumstances. However, the high command tried to appease her.\n\nAlso Read – Chandrababu Asked Me Why YSRCP Won 11 Seats\n\nSaritha has already warned of serious consequences if Bandla is included in the party. Despite her objections, considering the future needs of the party, the leadership gave a green signal for Bandla to join. He donned the Congress scarf in July in the presence of CM Revanth.\n\nEven though the High Command approved, Saritha did not agree to Bandla’s inclusion in Gadwala. She and her followers feared that their political future would be jeopardized with Bandla’s inclusion. However, with Bandla joining, the situation reversed. Bandla decided not to continue with the Congress, realizing it was not beneficial for him.\n\nAlso Read – KK Surveys Bang-On Prediction For Maha Elections\n\nSaritha was reassured by the leadership that her priority would not decrease even with Bandla in the party. Despite being given preference over the sitting MLA in the high command constituency, Bandla was dissatisfied as Saritha’s influence remained strong in the segment.\n\n\n\n\n\n\n\n\n\nAfter Saritha Tirupatiah effectively sidelined Bandla’s efforts to gain leverage in the ruling party, Bandla Krishnamohan Reddy returned to BRS, believing it was better to be there than in the INC.",
        "top_image": "https://www.m9.news/wp-content/uploads/2024/07/gadwal-mla-bandla-krishna-mohan-reddy-return-to-brs.jpg",
        "link": "https://www.m9.news/politics/story-behind-bandla-krishna-mohan-reddy-return-to-brs/"
    },
    {
        "title": "Despite KCR's efforts to keep flock together, BRS at receiving end with desertion of MLAs, MLCs",
        "author": [],
        "publish_date": null,
        "text": "Despite KCR's efforts to keep flock together, BRS at receiving end with desertion of MLAs, MLCs\n\nTill date, seven MLAs and six MLCs of BRS switched over to the Congress since the Assembly polls. Several other leaders, including BRS Rajya Sabha member K Keshav Rao, his daughter and Hyderabad Mayor Vijaya Laxmi R Gadwal, also joined the Congress.",
        "top_image": "https://images.deccanherald.com/deccanherald%2F2024-07%2Fe937a4a8-9c6c-405b-bc59-c2c2c1753ea8%2Fkcrpti_1_1170930_1670837055.jpg?rect=0%2C8%2C3264%2C1714&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
        "link": "https://www.deccanherald.com/india/telangana/despite-kcrs-efforts-to-keep-flock-together-brs-at-receiving-end-with-desertion-of-mlas-mlcs-3095660"
    },
    {
        "title": "V Lakshminarayana Assumes Charge as Additional Collector (Revenue)",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-09-30",
        "text": "Gadwal: V. Lakshminarayana assumed charge as the Additional Collector (Revenue) of Jogulamba Gadwal district on Monday. He took over his duties in his chamber at the Integrated District Offices Complex. Prior to assuming charge, he met Collector B. M. Santosh at the camp office for a courtesy visit.\n\nPreviously, Lakshminarayana served in the Land Acquisition Department of GHMC, Hyderabad, and was transferred to the district as the Additional Collector. Srinivas Rao, who had been handling full additional responsibilities as Additional Collector, will now continue as the Special Deputy Collector for Land Acquisition.\n\nVarious department officials, including Collectorate AO Veerabhadrappa and office staff, met the new Additional Collector, welcoming him and extending their best wishes.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/09/30/1484944-additional-collector.jpg",
        "link": "https://www.thehansindia.com/telangana/v-lakshminarayana-assumes-charge-as-additional-collector-revenue-910917"
    },
    {
        "title": "DK Aruna a Frontrunner for Union Cabinet",
        "author": [
            "Dc Correspondent",
            "About The Author"
        ],
        "publish_date": "2024-06-07",
        "text": "HYDERABAD: BJP vice-president D.K. Aruna is likely to find a berth in the Union Cabinet. As a prominent political figure in the state, the BJP feels that she can strongly counter the Congress government in Telangana at the national stage.\n\nHailing from a political family, the BJP’s MP-elect from Mahbubnagar had once taken former chief minist er K. Chandrashekar Rao head on, when she was a legislator from Gadwal.\n\nAruna’s family has maintained a strong bond with people over the decades. Her father Chitlem Narasi Reddy and brothers were strong leaders in Narayanpet area. She married into a family of politicians in Gadwal.\n\nDharmavaram and Kottam – two small villages in Mahbubnagar, near Kurnool — stand for the 'DK', which is the family name. Her family has held on to the Gadwal seat for generations, except a few times. Aruna herself won Gadwal seat twice with the Congress and served as minister between 2009 and 2014.\n\nAfter joining the BJP in March 2019, she quickly rose in the ranks and at one stage was tipped to be the state party chief. Months later, she contested the 2019 Lok Sabha elections from Mahbubnagar and lost. She was appointed as BJP vice-president in September 2020.\n\nIn a tough fight in the recently held Lok Sabha elections, Aruna defeated Vamshi Chand Reddy of the Congress. Her family’s connections at gross root level and her assurance to voters to focus on local development with central funds, helped her romp home. Even after the Congress utilised all the machinery to defeat her, Aruna won the Mahbubnagar Lok Sabha seat where all the seven Assembly segments are with the Congress.\n\nShe participated in an agitation after the power bills had steeply increased during the previous Chandrababu Naidu government in undivided AP. She also did Pada Yatra from Gadwal to the state capital to highlight the water problems in her region and highlighted mass migration of `Palamuru workers’ to other states.\n\nation scheme as per the first and original plan, for the dry lands of the district. She also took part in a hunger strike to protest against the the BRS government's refusal to carve Gadwal out as part of a new district in September 2016.\n\nAruna went on an indefinite hunger strike seeking irrigation water and implementation of Palamuru-RangaReddy lift irrig",
        "top_image": "https://www.deccanchronicle.com/h-upload/2024/06/07/1095607-htneu0ae400x400.jpg",
        "link": "https://www.deccanchronicle.com/nation/politics/dk-aruna-a-frontrunner-for-union-cabinet-897883"
    },
    {
        "title": "Gadwal Police Crack Day Light Theft Cases , Recover 19 Tulas of Gold",
        "author": [
            "M Veeresh"
        ],
        "publish_date": "2024-07-22",
        "text": "Gadwal: Gadwal Police Crack Day Light Theft Cases , Recover 19 Tulas of Gold.In a significant breakthrough, the Gadwal police have successfully solved a series of daylight thefts that targeted three houses in Gadwal town and Gattu village. The authorities arrested the accused, Nandine Mahesh, a 30-year-old laborer from Nandinne Village, and recovered 19 tolas of stolen gold.\n\nThe accused, driven by financial difficulties and addiction to alcohol, committed the burglaries during the day when the houses were unoccupied. Mahesh's method involved breaking into locked residential houses and looting gold and cash. The thefts included a range of gold ornaments, such as gold chains, necklaces, rings, and other jewelry items.\n\nOne of the victims, Mitikila Veera Pratap, reported the theft from his residence on Panduranga Street, Gadwal Town. The police registered the case under Cr No 160/2024 U/s 454, 380 IPC. Another case, registered at Maldakal Police Station under FIR No 131/2024, also linked Mahesh to a theft in Maddelabanda village.\n\nFollowing a detailed investigation, which included the analysis of CCTV footage and other technical evidence, the police team, under the personal supervision of DSP Gadwal Satyanarayana and Additional SP Jogulamba Gadwal District K. Guna Shekhar, managed to apprehend Mahesh. The arrest took place near the new bus stand in Gadwal on July 22, 2024, based on reliable information.\n\nThe successful operation, carried out by a special team including CI Bhim Kumar,SI Srinivas, and head constable Ranjith, culminated in the recovery of the stolen gold and the remand of the accused. The District SP specially commended the officers and staff for their exemplary work in solving the case.\n\nPRO, District Police Office, Jogulamba Gadwal District.",
        "top_image": "https://assets.thehansindia.com/h-upload/2024/07/22/1464476-police.jpg",
        "link": "https://www.thehansindia.com/telangana/gadwal-police-crack-day-light-theft-cases-recover-19-tulas-of-gold-893781"
    }
]